{
  "topProducts": [
    {
      "name": "Tokkumaa",
      "description": "A flavorful and spiced dish of mixed beans and vegetables.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "We ordered the Tokkumaa and Yebeg Alicha to share and we're absolutely amazed and shocked at the amount, presentation, an quality of the food",
        "Highly recommend a visit and try: veggie sambusa (perfectly crispy), miser, lega tibs (delightful jalepeno flavor), kitfo (well done), potato and carrot alicha, tokkumaa"
      ]
    },
    {
      "name": "Veggie Sambusa",
      "description": "Perfectly crispy fried pastry filled with vegetables.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Highly recommend a visit and try: veggie sambusa (perfectly crispy), miser, lega tibs (delightful jalepeno flavor), kitfo (well done), potato and carrot alicha, tokkumaa"
      ]
    },
    {
      "name": "Vegie combo",
      "description": "A combination platter of various vegetarian dishes.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "The Sambusas 10/10, the Vegie combo 10/10, the Zil zil Tibs:11/10, the gingery tea: perfect",
        "I have tried to post a photo because the vegie combo was delightful but it is not accepting the photo"
      ]
    },
    {
      "name": "Gingery tea",
      "description": "A hot, ginger-flavored tea.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The Sambusas 10/10, the Vegie combo 10/10, the Zil zil Tibs:11/10, the gingery tea: perfect"
      ]
    },
    {
      "name": "Miser",
      "description": "Flavorful and delicious lentil stew.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "Highly recommend a visit and try: veggie sambusa (perfectly crispy), miser, lega tibs (delightful jalepeno flavor), kitfo (well done), potato and carrot alicha, tokkumaa",
        "For veggies, the miser, potato and carrot alicha, and roasted beets are phenomenal"
      ]
    },
    {
      "name": "Potato and carrot alicha",
      "description": "A dish with potatoes and carrots.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "Highly recommend a visit and try: veggie sambusa (perfectly crispy), miser, lega tibs (delightful jalepeno flavor), kitfo (well done), potato and carrot alicha, tokkumaa",
        "For veggies, the miser, potato and carrot alicha, and roasted beets are phenomenal"
      ]
    },
    {
      "name": "Beets",
      "description": "A dish made with beets.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "Wasn't sure what to order but the potato/carrot, beets, midway tibs, and the collard greens were great",
        "For veggies, the miser, potato and carrot alicha, and roasted beets are phenomenal"
      ]
    },
    {
      "name": "Collard Greens",
      "description": "A dish made with collard greens.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Wasn't sure what to order but the potato/carrot, beets, midway tibs, and the collard greens were great"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Andrew Zay",
      "rating": 5,
      "text": "Some of the best Ethiopian food in the Twin Cities. Everything is so flavorful. I’ve loved the combo meals that feature both kitfo and tibs, but the vegetarian and vegan options are excellent as well. Repeat customer, will be back.",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Dan Salem",
      "rating": 5,
      "text": "I stumbled upon this wonderful new restaurant in Maple Grove with meat and vegan options. I can’t wait to go back! The vegan sampler was out of this world, as were the appetizers. My friend had a couple different traditional meat dishes.",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Adarus Ali",
      "rating": 5,
      "text": "My wife and I absolutely love this Ethiopian restaurant—it’s been our go-to spot for a long time, and for good reason. The food is always delicious and truly authentic, with flavors that keep us coming back again and again. The service is consistently top-notch, and you can really feel the pride they take in taking care of their guests.\n\nWhat really touched us recently was how the owner/chef went above and beyond. My wife had just graduated, and he surprised us by making a special cake just for her. It was such a thoughtful gesture and made the night unforgettable.\n\nIf you’re looking for amazing food, great service, and a place that treats you like family, this is the spot. Highly recommended! 👌🏾🍽️🎉",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Blue",
      "rating": 5,
      "text": "Bole Ethiopian Cuisine has some of the best food, service, and atmosphere of any of the restaurants I have been to in the twin cities. We ordered the Tokkumaa and Yebeg Alicha to share and we're absolutely amazed and shocked at the amount, presentation, an quality of the food. Each bite was unique and delicious, filled with so much flavor and spice. We left completely full, in spirit and in stomach, several take out containers filled with food for several more meals later this week. Thank you Bole for the excellent service and community.",
      "date": "a week ago",
      "source": "Google"
    },
    {
      "author": "Carey Sir",
      "rating": 5,
      "text": "Popped in for lunch on New Years' Day...DELICIOUS!! We've eatten at most of the Ethiopian restaurants in the Twin Cities, and Bole is far superior to them all. The food was fresh and uniquely yummy. The Sambusas 10/10, the Vegie combo 10/10, the Zil zil Tibs:11/10, the gingery tea: perfect!\nWe loved the warm decor and the music...the waitress could have been more friendly (we were the only customers in the place, but she was completely engaged by her phone). But all in all, a hearty 5 stars! We'll be back.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Alicia Shinn",
      "rating": 5,
      "text": "I was looking for a unique yet flavorful place to eat while in Minnesota on business travel and came across this spot! At first glance, you think you’re in the wrong location, but you’re not!\nAs soon as I opened the door I was greeted and seated, which is an A+ for me.\nMy waitress was amazing with the recommendations.\nI tried the Midway dish with the three sides.\nEVERYTHING WAS FLAVORFUL AND GOOD!\nCome try it, you will not be disappointed!!",
      "date": "7 months ago",
      "source": "Google"
    },
    {
      "author": "Allyson C",
      "rating": 5,
      "text": "Got the half meat / half veggie combo and instantly knew I would have to come back soon because it was delicious! I went with my brother who suggested what veggie dishes to get, and I was amazed at how good everything was. For example, I normally don’t like lentils, but the lentils here might have changed my mind with just how flavorful and delicious they were.\n\nOne of my favorite recent meals and a place I want to make one of my new regular places!",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Teklie Yohannes",
      "rating": 5,
      "text": "Bole Restaurant is simply outstanding! The food is always fresh and delicious, the service is excellent, and the hospitality is warm and welcoming. I recently brought my friends, and they were just as impressed. Maintaining such consistent quality for so many years is rare—this truly is one of the best restaurants around!",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Mai Yer Xiong",
      "rating": 5,
      "text": "Delicious food, fast and friendly service. Love the tibs! Great vegetarian options too. Nice indoor and patio seating. The injera is good and they serve a generous amount with each entree. The best Ethiopian food I've tried in the Twin Cities!",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Lauren Lathrop",
      "rating": 4,
      "text": "Great flavors and options for a lovely Ethiopian meal. Our large group shared several plates and everything was delicious. Service was a bit slow and we were waiting on water refills or the chance to order now drinks a few times. Our group of seven were seated in a small booth with deep seats that felt a little cramped and warm. Overall, a nice dinner with a few small issues.",
      "date": "4 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:23:12.477Z"
}