{
  "topProducts": [
    {
      "name": "Fried Sweet Plantains",
      "description": "Caramelized and yummy, served with an interesting green dipping sauce.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We started with the fried sweet plantains, really caramelized and yummy"
      ]
    },
    {
      "name": "Yucca Fries",
      "description": "Side of yucca fries.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Ordered chicken chilaquiles verde with a side of yucca fries and fried plaintains"
      ]
    },
    {
      "name": "Rice",
      "description": "Delicious rice.",
      "category": "appetizer",
      "reviewMentions": 9,
      "badge": "Top Pick",
      "quotes": [
        "Hard to find this good of smoked food in Minneapolis for a reasonable price so definitely will be back",
        "Also, after we signed our contract with them, they increased the prices of the food, pay of their employees, and serving ware by over 10%",
        "Their rice continues to be delicious"
      ]
    },
    {
      "name": "Coconut Pudding",
      "description": "A vegan dessert option.",
      "category": "dessert",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": []
    },
    {
      "name": "Sangria",
      "description": "A beverage option.",
      "category": "drink",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "Make sure to order a sangria",
        "Do wish sangria on menu would actually be available"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Henry Stern",
      "rating": 5,
      "text": "Had a supreme experience at Brasa. Jacob took excellent care of us, including with my food allergies.\n\nLabelled on their paper allergen menu are major allergens, gluten, garlic/onion/nightshades/cilantro, and even GMO-free.\n\nWith my egg and nut allergy, I had the vegetarian curry bowl (which is vegan, in fact) as well as rice and beans. Delicious! And on a quiet Monday, it only took about ten minutes to get the food.\n\nLovely outdoor patio and quick service are a wonderful combination! And we're still raving about how great host Jacob is.\n\nWill be back!",
      "date": "7 months ago",
      "source": "Google"
    },
    {
      "author": "Venita S",
      "rating": 5,
      "text": "Dad came to visit us in Minneapolis from Florida. Brought him in for a surprised birthday dinner here. Everyone from the host, cashier, and servers is so attentive and full of great positive energy! Jacob - one of the most amazing servers that I ever met really made my day and made this birthday surprise above and beyond special! Thank you so much! We will recommend your restaurant to friends and family :)",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Madison",
      "rating": 5,
      "text": "We had Brasa cater our wedding and they were absolutely incredible! From start to finish, they were efficient, easy to communicate with, and so accommodating to our needs. The food was absolutely amazing—our guests couldn’t stop talking about it. On top of that, they went above and beyond by leaving us a thoughtful to-go bag with food and champagne at the end of the night. It was the perfect touch after such a special day. Highly recommend Brasa for any wedding or event!",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Mika Baer",
      "rating": 5,
      "text": "The menu is rooted in Southern and Caribbean-inspired flavors, and everything is made with care. My personal go-to is the pulled chicken, which is juicy, tender, and perfectly seasoned. Pair it with the creamed jalapeño spinach - a side dish so unexpectedly addictive that I now find myself ordering it every time, no matter what else I get.\n\nThe atmosphere is casual and welcoming, with a laid-back counter-service setup that somehow still manages to feel intentional and warm. It’s the kind of place where regulars bring newcomers, knowing the food will speak for itself.\n\nOther favorites include the slow-roasted pork, collard greens, and desserts. They are all flavorful, filling, and made to be mixed, matched, and shared. The portions are generous, and there are great options for gluten-free and dairy-free diners, too.\n\nBrasa doesn’t try to be trendy or overcomplicated. It focuses on doing comfort food right. With quality ingredients, bold flavor, and heart, if you’re looking for a meal that hits all the right notes without trying too hard, this is it.\n\n@foodiemsp on Instagram",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Andrew Butterbrodt",
      "rating": 5,
      "text": "Have loved eating here and getting takeout for years. Recently picked up an order when coming back into town from a camping trip and my wife remarked how this is the best takeout around and always satisfies. Leftovers keep well too so it’s just as good the next day. The collard greens with smoked chicken are my favorite side; they put most other collards to shame. Douse them (and your chips) with the hot pepper vinegar to really make them great.",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Lake Katrina",
      "rating": 4,
      "text": "One of our family favorites whenever we go through Minneapolis! The food is always fantastic, authentic & fresh!!!\nI always go with a BOWL! I recommend the smothered chicken (it's so moist) or the pork bowl! Everytime we go I buy a hot vinegar to take home as well. Brasa would easily be a 5 star place but the recent move to QR code orders is a bit frustrating.",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Annah Tessier",
      "rating": 5,
      "text": "Brasa recently catered our wedding on 3/22/25 and I truly can not give them the praise they deserve. We decided to try Brasa after having their food at a wedding last summer - phenomenal.\n\nThey were easily the best vendor we worked with throughout the wedding process. Not only was the food and service exceptional, they truly helped us cut costs in certain areas with how helpful and accommodating they were (filling waters, folding napkins/doing linens, setting up desserts, etc.). Additionally, their staff was outstanding and has awesome attitudes all day.\n\nWe had over a dozen guests with food restrictions and allergies, and they had everything labeled accordingly and their food options were also fantastic.\n\nThey kept me calm, organized, and not to mention, the food was affordable on top of the incredible flavor.\n\nPlease consider them for your events or wedding. I could go on and on about this experience.\n\nThank you so much, Brasa team! You truly attributed to making our special day unforgettable.\n\nLove, the Amacci’s",
      "date": "10 months ago",
      "source": "Google"
    },
    {
      "author": "Linda McLoon",
      "rating": 5,
      "text": "I forgot how truly delicious the food is at Brasa. I needed to pick up food for an event, and decided to get take out.\n\nWe started with the fried sweet plantains, really caramelized and yummy. They are served with an interesting green dipping sauce. Lovely. We had the pulled pork sandwich, which is served with pickles and green sauce. The meat was so tender, and the accomplishments really complemented the pork. I absolutely adored the smothered chicken sandwich, which is served with red sauce and coke slaw. My goodness - this was DELICIOUS! They both came with house made tortilla chips - these were just as yummy the next day!\n\nI enjoyed the butterscotch pudding also. The only slightly negative note was the chocolate cake, which was dry despite the whipped cream and topping.\n\nI heartily recommend Brasa, in particular that fabulous smothered chicken!!\n\nYou can eat in, or order for takeout also.",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Artemis Swanson",
      "rating": 5,
      "text": "What can one say about Brasa that is not already spoken for in just one meal with them?\nThe service is spectacular, servers are responsive and knowledgeable about the menu, and the cozy atmosphere allows for a fast transition from seating to eating.\n\nShoutout to Enrique for being super helpful in walking us through menu options!\n\nThe menu never disappoints. The piece of paper itself is neat and detailed. As a couple with annoying dietary needs, my lover and I are always grateful to be able to determine quickly which dishes are okay for us to eat, able to be substituted, or need to be avoided. From paper to palette the quality continues, with a delightful combination of South American, Soul, and Caribbean cooking.\n\nOverall, one of my favourite restaurants in this city. Give it a try!!!",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Rochelle Becker",
      "rating": 5,
      "text": "The entire menu looks amazing!  It was hard to choose!  Ordered chicken chilaquiles verde with a side of yucca fries and fried plaintains.  The green sauce is so incredibly good.  Everything was cooked perfectly.  Service was great!  Attentive but not overbearing.  Atmoshere was busy but not distracting or unpleasant! Absolutely will stop here anytime I am in town!!!",
      "date": "3 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:31:54.205Z"
}