{
  "topProducts": [
    {
      "name": "Wild Sweet Potato",
      "description": "A food item, possibly an entree or side dish.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Food is fantastic I had the Wild Sweet Potato and the red beet asparagus salad and finished it with a amazing tres leches cupcake that was out of this world"
      ]
    },
    {
      "name": "Red Beet Asparagus Salad",
      "description": "A salad featuring red beets and asparagus.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Food is fantastic I had the Wild Sweet Potato and the red beet asparagus salad and finished it with a amazing tres leches cupcake that was out of this world"
      ]
    },
    {
      "name": "Focaccia",
      "description": "A type of Italian bread.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": []
    },
    {
      "name": "Coffee",
      "description": "A classic brewed coffee beverage.",
      "category": "drink",
      "reviewMentions": 11,
      "badge": "Top Pick",
      "quotes": [
        "Great Soup and Salad options and Latte/Coffee worthy Desserts",
        "Great coffee, great cake selection, great sandwiches, pizza,wine and beer",
        "Cafe Latte serves both timeless, favorite comfort food, but also exceptional lattes, coffee, tea, and desserts"
      ]
    },
    {
      "name": "Tea",
      "description": "A hot or cold brewed tea beverage.",
      "category": "drink",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "Cafe Latte serves both timeless, favorite comfort food, but also exceptional lattes, coffee, tea, and desserts",
        "Server was more content on telling me what he could't do instead of accommodating my request"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Lillys Osorio",
      "rating": 5,
      "text": "😀Today I visited Cafe Latte. I was served by Duffez,👈👌 who was very quick and friendly. Then a Mexican gentleman who speaks Spanish💪 found me a menu and was very helpful. I will return and I recommend it. They have vegan and gluten-free options.✨️",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Christian Engelbrecht",
      "rating": 5,
      "text": "Visiting yesterday, I saw they were celebrating 40 years and I think I've been coming here about that long. I left Minnesota a while ago, but whenever I come back, this is often the first place I go. In an era of chains and copycat restaurants, I find this place truly unique and really appreciate that. The quality of food, I think, is also exceptional. I always look forward to my bowl of chili and a takeaway slice of turtle cake for later on. Thanks to the owners who started this and kept this going for the last 40 and all the best for the next 40 to come.",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Rivix K",
      "rating": 5,
      "text": "Easily one of my favorite places. Friendly service, clean building, and amazing desserts. So far I havent found a better place to get cake. I would definitely recommend during summer to get their fruit tart cake slice. Otherwise their chocolate cakes and cheesecake style cakes are a favorite of mine.",
      "date": "a week ago",
      "source": "Google"
    },
    {
      "author": "Magarara",
      "rating": 5,
      "text": "I love their food! The desserts are another notch as Emeril used to say. The soup is beyond wonderful. I think it was artichoke leek I had. Given that it was -24° F, (-47° F with wind chill) it hit the spot. Unfortunately the prices have increased dramatically.",
      "date": "Edited 2 days ago",
      "source": "Google"
    },
    {
      "author": "Jeannie Hill",
      "rating": 5,
      "text": "I've been going to Cafe Latte for years and years; meeting clients for business, taking a dear senior friend on an outing, going out to eat with fellow dancers before or after a class, or just for my own pleasure. It's a bit like a salad, soup, and sandwich bar, where you make selections and place your order as you go. However, I'd call this gourmet quality menu entrees.\n\nMy favorite is to order their three salad combos. The selection is great, with a good variety of flavors and cuisines, and they are unusually tasty. Cafe Latte serves both timeless, favorite comfort food, but also exceptional lattes, coffee, tea, and desserts. Individuals can select from gourmet pizzas to their own award-winning Blueberry Lemon Scones and Turtle Cake.\n\nIf you want the European clotted cream / scone experience, this is as close as you can come to it in the United States. I highly recommend going for scones first thing in the morning, when you cannot the \"fresh out of the oven\" flavor.\n\nRecently, I wanted to thank a helpful neighbor by gifting them with a cheesecake. I checked closer to home, in Minnetonka, Eden Prairie, and Edina - no one else had full cheesecakes ready for pickup-and-go. Not only that, Cafe Latte, has them in three sizes as well as selling cheesecake by the slice. In addition, you have multiple flavors to choose from. For my neighbor, I selected their Classic Vanilla Cheesecake. It's boxed nicely and is a stunning presentation with whipped cream and strawberries on top.\n\nThere are three distinct dining areas an upstairs, lower-level tables and booths, as well as the dessert/coffee lounge on the south end. Conveniently, they have two cash register areas.\nLarge men and women restrooms are available directly across the hall. There is street parking and a paid parking lot across the street on the west. To avoid peak hours, I recommend going mid-afternoon.\n\nExcellent service. Top notch ambience.",
      "date": "Edited 4 weeks ago",
      "source": "Google"
    },
    {
      "author": "Mathew Heart",
      "rating": 5,
      "text": "We ordered a ton of tres leches pastries in various flavors for our Christmas party, along with their chocolate truffles, and everything was perfect!\n\nThe packing was amazing--neat and secure. The service was excellent, and the staff made the entire process so smooth. As for the sweets, they were absolutely delightful! Every bite was flavorful and worth raving about.\n\nThe quality was top-notch, and everything was incredibly tasty. Parking on the street can be a bit of a challenge, but it's well worth the effort for treats this good.\n\nHighly recommend for any special occasion--or just because!",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Ia Vang",
      "rating": 4,
      "text": "The last time I came here, I got overwhelmed and intimidated and just left LOL but that was back in high school. I'm an adult now and this place was still intimidating, but as soon as I got the gist of it, everything was easy and great. The cakes are delish, their pizzas are good, and their salad/sandwich bar is fast-paced. Only thing I'll complain about is that they don't have wifi... being that it's a cafe, I'm not sure why they don't. So if you plan to do school work or anything on your laptop, this may not be the best pick for you!! Overall, still a great establishment <3",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Sandy Waterman",
      "rating": 5,
      "text": "A favorite since the 1980s, at St. Paul's Victoria and Grand intersection..  Freshly prepared, flavorful salads, soups, coffee shop-style beverages, breads, and desserts, plus amaretto, coffee, and raspberry truffles (all three gluten free!).  Cafeteria line, plus table and booth seating on two levels.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "asha p",
      "rating": 5,
      "text": "One of my favourite spots for dessert date night. Have only tried the sweet treats so far, which tend to be on the pricier side. Have dined in a few times but depending on the time/day it can be very busy and hectic. The raspberry cream torte, banana cake, flourless chocolate cake, and vanilla tres leches were all very tasty.",
      "date": "4 weeks ago",
      "source": "Google"
    },
    {
      "author": "Poppy",
      "rating": 4,
      "text": "The food is excellent. My experiences with service have been mixed. Today, the chick serving was quite rude, rolling her eyes and sighing at me. I really can’t imagine why. I smiled, asked for what I wanted, and said thanks, that was the extent of the interaction, add in her asking one question, which I answered “yes, please,” and and her unexplainable huffing and eye rolling. She did not greet me or thank me, only acted like I was somehow a pain in her side. I’m not asking for stellar customer service, only for kindness to other humans. I have been there twice before and once had excellent service and the other time it was fine and unremarkable. I guess they can’t all be stars. 🤷‍♀️",
      "date": "Edited a month ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:31:26.661Z"
}