{
  "topProducts": [
    {
      "name": "Tempeh Sandwich",
      "description": "Absolutely delicious.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Very lovely cafe, I had the tempeh sandwich and garlic fries"
      ]
    },
    {
      "name": "Garlic Fries",
      "description": "Served with the tempeh sandwich.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Very lovely cafe, I had the tempeh sandwich and garlic fries"
      ]
    },
    {
      "name": "Coffee",
      "description": "Excellent, tasty, and superb coffee, including espresso.",
      "category": "drink",
      "reviewMentions": 13,
      "badge": "Top Pick",
      "quotes": [
        "Keep that in mind, they don't spoil you here with service of that level, but instead exchange it for delicious food and tasty coffee",
        "Excellent coffee\nFresh baked goods\nVery pleasant staff",
        "The coffee is superb and everything on the menu is great"
      ]
    },
    {
      "name": "Chips and Salsa",
      "description": "Excellent side with house-made salsa.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The chips and salsa on the side were excellent too, and the salsa was definitely house-made"
      ]
    },
    {
      "name": "Beer",
      "description": "Available to drink.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Had a beer, cookie and fish tacos and couldn't ask for anything more"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "jesse james johnson",
      "rating": 5,
      "text": "I love the focus of the local spending this place does and they also have an awesome catering shop that I've been able to check out at some heavy table events. While in recent years I feel like they've moved away from their adventurous menus, perhaps, since I'm a regular customer I've become unadventurous when eating there but the food quality has remained top notch. Common Roots is the best place to grab a coffee & scone and it also is a great place for breakfast and lunch. I'd really like it if more items could be made vegan. I don't come here nearly as often as I once did because a lot of items that could be vegan just don't have that option.",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Russell Milles",
      "rating": 4,
      "text": "Order from online and they bring it to your table. Gratuity included. Clean bathrooms. Parking lot in back. Service is fast and friendly. Prices are ok. Food is good. Vegan friendly.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Becca Schilling",
      "rating": 5,
      "text": "We love Common Roots Cafe, and had them cater for our wedding. The food was absolutely *delicious*. Everyone loved it, and I still think about that turkey at least once a week. They went above and beyond with the planning process leading up to the wedding, and were so incredibly helpful and thoughtful. I loved getting to work with them, and cannot stress how much I appreciated all they did for us!\n\nI have dietary restrictions, and we selected passed apps for cocktail hour that I couldn't eat. They asked me ahead of time if I would like them to make a couple things special for me and I told them not worry about it as I'd have plenty of food shortly after for dinner time. They flagged me down during cocktail hour with a plate of specially made appetizers just for me. And I don't mean, like, a simple veggie tray or something. They specifically went out of their way to make a few gluten free and dairy free versions of the tarts we were serving guests, just for me. Unbelievable service and care.\n\nAmazing food, and incredible employees. We highly recommend both their catering and their cafe!",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Lynx Cheam",
      "rating": 5,
      "text": "Good times were had. Service was great. As part of my first time out to MN, I would say this place is easily worth the visit.\n\nWhen done with meal, you bus yourself. Keep that in mind, they don't spoil you here with service of that level, but instead exchange it for delicious food and tasty coffee.\n\nPictured: Shakshuka, Small Hot Mocha, Large Hot Salted Caramel",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Shannon Mahedy",
      "rating": 5,
      "text": "Wow! I went to Common Roots cafe for brunch today, and I was blown away by the fish tacos. They were, without a doubt, the best fish tacos I’ve ever had! They were light, delicately-balanced, fresh, and flavorful. Each bite was incredible, and I found myself telling my friend how delicious they were over and over while I devoured my tacos. The chips and salsa on the side were excellent too, and the salsa was definitely house-made. My only wish were that there were more tacos on my plate. I’ll be back for more tacos soon! I’m very impressed by this dish!",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Casey Lee",
      "rating": 5,
      "text": "Not only does Common Roots provide amazing food, but their service is top-notch. All of our guests told us how much they enjoyed the appetizers, dinner, and snacks. We had such a positive experience working with Tiffany throughout our planning process. When the pandemic hit Minnesota, the Common Roots Catering team was flexible and very helpful as we had to replan most of our wedding. The day of catering team also did a great job dropping off the food and helping set up the quickly.",
      "date": "Edited 4 years ago",
      "source": "Google"
    },
    {
      "author": "Kari Johnson",
      "rating": 5,
      "text": "Common Roots is a great business to support and they make it easy. They've got great coffee and drink options, and lots of delicious items on their menu. They also have been paying their employees a fair wage for years, they source local foods, support the community when they can and allow dogs on their patio, what's not to love!?\n\nUPDATE! The expanded outdoor seating options are fantastic! Love being able to walk over enjoy great coffee and a meal outside!",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Ashley Belisle",
      "rating": 5,
      "text": "What can I say? This place is amazing. Phenomenal staff, wonderful values that show, and I dream about the Common Roots bagel, egg, and cheese. I placed a delivery order that never arrived (Door Dash's fault, not the restaurant's), so they remade my order and delivered it personally instead – with extra bakery treats to boot. Truly the best.",
      "date": "Edited 4 years ago",
      "source": "Google"
    },
    {
      "author": "Karen Lunde",
      "rating": 5,
      "text": "Common Roots Café, at 2558 Lyndale Ave S, offers great food and beverages, including at least four (4) Fair Trade products. These include Fair Trade Bananas and Fair Trade Sugar from Equal Exchange, Black Squirrel Espresso roasted by Peace Coffee, and Rishi Jasmine Green Tea.\n\nThank you for helping to eliminate poverty & protect the environment by selling Fair Trade products, and welcome to Fair Trade Minneapolis!",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Birdy Adams",
      "rating": 5,
      "text": "This place was delicious! Everything that we got was great! I loved the online menu it made the whole experience quick and easy! The service was great! I'm so happy they pay their employees enough that they don't accept tips! I didn't realize how stressful tipping was til I didn't have to! I hope more restaurants adopt this!",
      "date": "4 years ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:28:01.164Z"
}