{
  "topProducts": [
    {
      "name": "Samosas",
      "description": "Huge, vegetarian & vegan entrees.",
      "category": "appetizer",
      "reviewMentions": 3,
      "badge": "Popular",
      "quotes": [
        "Classic Nepalese/Indian decor; the samosas are huge, vegetarian & vegan entrees",
        "They have many tasty vegetarian options, including veggie samosas",
        "The samosas would be part of my last meal on earth"
      ]
    },
    {
      "name": "Veg Momo",
      "description": "Handmade vegetable dumplings.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The Veg Momo's are amazing and obviously handmade"
      ]
    },
    {
      "name": "Jogi Tarkari",
      "description": "Vegetable curry with big chunks of vegetables.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The Jogi Tarkari cooked to perfection as well with big chunks of vegetables"
      ]
    },
    {
      "name": "Roti",
      "description": "A type of flatbread, often served with entrees.",
      "category": "food",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "I ordered the veggie momos, veggie curry and roti"
      ]
    },
    {
      "name": "Veggie Curry",
      "description": "A curry made with vegetables, prepared perfectly.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I ordered the veggie momos, veggie curry and roti"
      ]
    },
    {
      "name": "Daal Soup",
      "description": "A lentil soup that is very good for the soul.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "My friend ordered the daal soup and that was also very good for the soul"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Adrienne Cairn",
      "rating": 5,
      "text": "Everest on Grand is a delicious experience!  Their food is fragrant, tasty, and sensational!  I have been eating here for 25 years and it's always great.  Kid friendly, vegan and vegetarian options. And their classic yak momo's are worth driving for.  I really can't say enough good things about this restaurant.  Highly recommend!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Jamie",
      "rating": 5,
      "text": "Classic Nepalese/Indian decor; the samosas are huge, vegetarian & vegan entrees. Highly recommend their naan bread. Everything made in house and you can taste the freshness. Will be back. Perfect portions for two people to share.",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "Patrick",
      "rating": 5,
      "text": "I’ve been here twice and both times service has been fast and food has been delicious.  Great vegan options!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Abby Cole",
      "rating": 5,
      "text": "The food was delicious but a little pricey for what you got & atmosphere. Liked the many options for gluten-free & vegan...",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Timothy “Twin.City.Timothy” Lingenfelder",
      "rating": 5,
      "text": "Part of me wants to keep this place a secret but I can't be that selfish. Had dinner with my sis and nephews here the other night. Good Gawd the food is so over the top delicious, I can't stand it!\n\nThe staff is super friendly and fun as well!  I tend to be a little outrageous at times (no, really!) with inappropriate humor and making people smile, and it was fun when staff played along!\n\nThe spices are tasty and hot just as they should be (emphasis on the tasty) and I gotta level up to since level 4 (out of 6) the next time I am there!\n\nThank you Everest on Grand!  You are above and beyond!",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Bronshay Limson",
      "rating": 5,
      "text": "The food is delicious! Service is welcoming and pleasant. The atmosphere is delightful! Great family environment as well as date night! The food is amazing! I'm from Texas and whenever I'm back this way visiting my Mommy, it's a new family feeding ground. If you're ever in the Minneapolis/St. Paul area looking for great food. Stop by and be amazed!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Susan R",
      "rating": 5,
      "text": "This food is made with love for sure - you can taste it!  My husband and I had gone here years ago when we were dating and recently we wondered if it was still around...it is!!  We've been here 3 times in the last 2 months and love it! The Veg Momo's are amazing and obviously handmade. The Chicken Tikka Masala comes with big chunks of tender chicken marinated in an amazing sauce. The Jogi Tarkari cooked to perfection as well with big chunks of vegetables.  The Roti, Naan..also delish!  The menu is extensive so many options and choices for us as we will be making this our go-to comfort food stop in our dining rotation going forward!",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Mai Osteen",
      "rating": 5,
      "text": "Amazing food all around. My friends, husband, and I went here and got a few things to share as well as our own curries. We ordered 7 dishes altogether and every single one of them was a hit, which means you probably could hit the menu with a dart and still be happy with whatever it lands on. There are ample options for those with dietary restrictions as well.\n\nMy favorite bites were the yak momos and lamb curry, and I'm known for sometimes being a picky eater. I got the chicken spinach curry and it had a very cozy and warm flavor to it. My friend ordered the daal soup and that was also very good for the soul.\n\nThe atmosphere is very relaxed and quiet. This is the perfect spot for days when you're feeling low-energy and need some food that nurtures you, especially when the weather is cloudy and cool.\n\nThe staff was very friendly and attentive. I will definitely be returning.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Cheryllyne Vaz",
      "rating": 5,
      "text": "Everest On Grand will always have a special place in my heart. 16 years ago, when I was in mild labor with our oldest son, my husband and I ordered food from this restaurant.\n\nTomorrow Leo turns 16 years old. So on the eve of his birthday, out of nostalgia, we ordered the exact same dishes we ate before he was born.\n\nChicken Curry (Kukhura-ko Maasu), Goat Curry (Khasiko Maasu), Tomato Achaar and Potato Achaar.\n\nIt’s so lovely that this wonderful family-owned restaurant still exists, and we can share the exact same delicious dishes with Leo and his two other siblings.",
      "date": "11 months ago",
      "source": "Google"
    },
    {
      "author": "Drew Losure-McDermott",
      "rating": 5,
      "text": "My wife and I love Indian food, so this Nepali restaurant seemed like it would fit the bill (we had looked up the menu online just to be safe.\n\nWe arrived near to close, maybe 1 hour and 15 minutes before they closed up shop, but we still received quite excellent service. I strongly got the feeling that this is family owned and run business, which easily kicked it up a notch in my experience - and it was only confirmed when our food arrived.\nI started with a \"Taj Mahal Premium\" lager, imported from India - I quite enjoyed it, and wish I had ordered the larger size bottle (I don't normally drink much of anything, particuarly beer, but this was shockingly good), whereas my wife Elizabeth ordered a mango lassi (think like, a yogurt milkshake) since we both ordered the same dish, in the end - Palak Paneer; however I ordered mine to be of medium spiciness, Liz asked for \"as spicy as you can make it.\"\n...,my wife REALLY likes spicy food.\n\n>In the picture I will include with this upload, you will be able to tell which is hers - it is the one that is significantly darker orange than the other, far more delicious medium spiciness.\n\n.....oh, of course I am being facetious! To each their own and she doesn't take issue with my vegetarianism, so why would it bother me that she wants to butn her tongue off with flavors.\n\nWe both were enjoying our food extensively when our server came to check on us, and I asked him why the Palak was mostly orange when nerly every other Palak or Saag dishes had been 98% green. The server explained that the process they used was to blanch, blend, and then cook roma tomatoes, mixing most of the spices at that level, and then adding the blanched and shredded spinach (using nearly the same amount of spinach as they would've had to use without this method - and that the spices along with the acidity from the tomatoes allowed magnification of the details of the dish, sweetness and umami that were otherwise lost in such a spice-heavy dish.\n\nWe went home happy, with intent to patronize again (maybe even a place to take our parents soon!), and our leftovers didn't even last 12 hours in the refrigerator.\n\nTL;DR -everything was great, the slight bit higher prices WELL made to be worth the date night because of the quality, service, atmosphere and *EXTREMELY* flexible and diverse menu. Speaking from the perspective of a lifelong vegetarian, seeing so many main options on the regular menu is so, so heartening and vindicating....\n\nAnd in no way are the veggie options worse - they were the STARS of the menu.",
      "date": "a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:23:36.939Z"
}