{
  "topProducts": [
    {
      "name": "Spicy Fries",
      "description": "Small cut fries topped with a spice seasoning blend.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "My spicy fries were delicious & small cut, topped w/ a  delicious spice seasoning blend on top ( not spicy)"
      ]
    },
    {
      "name": "Foxy Falafel",
      "description": "Falafel dish served with tomatoes and cucumbers.",
      "category": "entree",
      "reviewMentions": 8,
      "badge": "Top Pick",
      "quotes": [
        "⚠️ If Foxy Falafel were going to stay open, I wouldn't go back",
        "I finally decided on the foxy falafel since it looked appealing with some tomatoes and cucumbers thrown in",
        "Love the Foxy Falafel"
      ]
    },
    {
      "name": "Cauliflower Steak",
      "description": "A steak-like dish made from cauliflower.",
      "category": "entree",
      "reviewMentions": 6,
      "badge": "Top Pick",
      "quotes": [
        "And finally the cauliflower steak, because it totally sounded unreal",
        "Highly recommend the curry falafel and cauliflower steak",
        "Cauliflower Steak and Gluten free cheese curds were very tasty"
      ]
    },
    {
      "name": "Mediterranean falafel and fresh veggies platter",
      "description": "A platter featuring falafel and fresh vegetables.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Cozy lil seating area, excellent Mediterranean falafel and fresh veggies platter, with unique canned drinks"
      ]
    },
    {
      "name": "Beet Falafel",
      "description": "A falafel variation made with beets.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "Tried the beet falafel, delicious",
        "I got the stoplight falafel salad - of, curry, and beet falafel (2 of each)"
      ]
    },
    {
      "name": "Stoplight Falafel",
      "description": "A specific variety of falafel.",
      "category": "entree",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "The Stoplight falafel is my favorite in town",
        "I got the stoplight falafel salad - of, curry, and beet falafel (2 of each)"
      ]
    },
    {
      "name": "Green Tahini Sauce",
      "description": "A flavorful tahini sauce.",
      "category": "appetizer",
      "reviewMentions": 0,
      "badge": null,
      "quotes": []
    },
    {
      "name": "Unique canned drinks",
      "description": "Various canned beverages.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Cozy lil seating area, excellent Mediterranean falafel and fresh veggies platter, with unique canned drinks"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Ashley Repp",
      "rating": 5,
      "text": "I was having a really hard day, so my husband took my to Foxy to cheer me up. The person working was amazingly kind to me, and truly a bright spot in an otherwise very difficult day. When I opened the take out bag, he had included a gluten free, vegan pudding with a little note on top that “pudding fixes everything.” However, it wasn’t the pudding that fixed everything, it was his kindness. Thank you Foxy Falafel for not just serving delicious food, but building community and compassion.",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "jesse james johnson",
      "rating": 5,
      "text": "I really enjoy the variety of their falafels as the stoplight is my go-to. They also have amazing baba ganush and grape leaf wraps but their cauliflower steak is amazing. Also suggest finishing it all off with the vegan ice cream sandwich.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Courtney Knight",
      "rating": 5,
      "text": "Amazing vegan options, tasty sauces, and an absolutely perfect little outdoor seating area. I'd be a regular here if I lived in Minneapolis!",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Hirute Amlack",
      "rating": 5,
      "text": "This place has amazing food!\nGreat vegan options!!!\nThe tomato coconut bisque... the best soup I have ever had!!!!\n\nCute and quaint place to enjoy a meal alone or with a date.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Jonathan Mauriala",
      "rating": 5,
      "text": "A fun small falafel place with a cozy, cute, and fun atmosphere. Many vegan and vegetarian options, friendly staff, and super tasty food with unique flavors. Lots of foxes",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Stomping Ground Studio",
      "rating": 5,
      "text": "A little gem in western St. Paul. I’ve enjoyed everything I’ve had here. The tomato coconut soup is awesome, and I really like the falafel sandwich 😋 and everything is VEGAN!",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Damon Brinson",
      "rating": 5,
      "text": "Vegan, gluten-free awesomeness (including mind-blowing brownies). You should eat there. It’ll make you happy.",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Troy Bagley",
      "rating": 4,
      "text": "This was a place I always wanted to check out, but when the friend wanted to stop here, I thought why not.  I liked how you either parked in the back or just around the corner.  Of course they had some seating inside, but they also had seating on the sidewalk outside.  I really didn't know what to expect so it took a few minutes to peruse the menu to decide.  I finally decided on the foxy falafel since it looked appealing with some tomatoes and cucumbers thrown in.  Of course the side salad was really amazing as it was not only colorful, but had a little bit of salad dressing spritzed throughout.  And finally the cauliflower steak, because it totally sounded unreal.  It was cool, because it looks like a steak, but made of cauliflower which tasted pretty good.  Of course once we got our food, we sat outside at one of the tables. It was not only so good and filling, that I had to take the rest home.  It was most definitely enough at least for a light lunch.  I definitely want to go back so badly.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Molly Eide",
      "rating": 5,
      "text": "Without a doubt my favorite restaurant in the Twin Cities. The food is fantastic with many options for meat lovers, vegetarians, gluten free, etc. I especially love the meal kit options for family dinner and the ability to order ahead online.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Nikole Slocum",
      "rating": 5,
      "text": "Loved stopping in at Foxy Falafel. They make gluten free eating easy, as the only thing that contains gluten here is the pita. Their kitchen is probably one of the safest kitchens for someone with Celiac. They know exactly what Celiac is, are knowledgeable on cross contamination, and have a protocol to make sure you’re safe. Great food, great people.",
      "date": "3 years ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegetarian restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:24:59.981Z"
}