{
  "topProducts": [
    {
      "name": "Juicy Lucy",
      "description": "A plant-based version of the classic Minnesota cheese-stuffed burger. Reviewers call it \"very good\" and so delicious they \"haven't stopped thinking about\" it. It is made with an Impossible patty.",
      "category": "Entree",
      "badge": "Top Pick",
      "quotes": [
        "(Juicy Lucy and Hunny Dijon Chicken Sandwich) Their shoestring fries were nice and hot and salty 😋\nSeveral members of their waitstaff came over to check on us, very attentive and friendly",
        "We had the juicy Lucy burger which was very good",
        "Haven’t stopped thinking about the juicy Lucy since I had it a few days ago"
      ],
      "reviewMentions": 7
    },
    {
      "name": "Chicken Sandwich",
      "description": "A vegan chicken sandwich praised for being \"tasty,\" \"awesome,\" and \"flavorful.\" A specific popular version mentioned is the \"Hunny Dijon Chicken Sandwich.\"",
      "category": "Entree",
      "badge": "Top Pick",
      "quotes": [
        "The chicken sandwiches and Chocolate shakes are awesome",
        "Got the Chicken sandwich and my gosh it was tasty",
        "The burger and fried chicken sandwich we got were both so flavorful and cooked to perfection"
      ],
      "reviewMentions": 13
    },
    {
      "name": "Fries",
      "description": "Described as tasty, seasoned, crispy shoestring fries served hot and salty. Considered by some to be \"MUCH better than other places.\" A \"Buffalo fries\" version is also mentioned.",
      "category": "Side",
      "badge": "Top Pick",
      "quotes": [
        "Delicious burger, tasty seasoned fries",
        "I also think their fries are MUCH better than other places",
        "(Juicy Lucy and Hunny Dijon Chicken Sandwich) Their shoestring fries were nice and hot and salty 😋\nSeveral members of their waitstaff came over to check on us, very attentive and friendly"
      ],
      "reviewMentions": 27
    },
    {
      "name": "Chocolate Milkshake",
      "description": "A vegan chocolate milkshake that is highlighted as being exceptionally good and a rare find.",
      "category": "Drink",
      "badge": "Popular",
      "quotes": [
        "I don't think I've ever had a vegan chocolate milkshake (let alone a good vegan chocolate milkshake) before coming here",
        "Delicious Juicy Lucy (Impossible) burger, crispy fries, and chocolate milkshake"
      ],
      "reviewMentions": 2
    },
    {
      "name": "Breakfast Burger",
      "description": "A breakfast-themed burger that was described as \"great.\" The breakfast menu in general was noted positively.",
      "category": "Entree",
      "badge": "Featured",
      "quotes": [
        "Had the breakfast burger and it was great"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Brownies",
      "description": "A dessert item described by a reviewer as \"super good.\"",
      "category": "Dessert",
      "badge": "Featured",
      "quotes": [
        "The brownies are super good"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Francisco Burger",
      "description": "A favorite burger for one customer, who specifically enjoys it made with a bean burger patty.",
      "category": "Entree",
      "badge": "Popular",
      "quotes": [
        "My favorite is probably the Francisco burger made with the bean burger but every burger I have tried has been very good",
        "Highly recommend the Francisco Burger"
      ],
      "reviewMentions": 2
    }
  ],
  "highlightedReviews": [
    {
      "author": "Davi Gray",
      "rating": 5,
      "text": "Delightful food options (for a vegetarian feeling oppressed by America's meat-forward culture). Honestly some of the best burgers I've ever eaten, even when compared to back when I ate cow meat. Jucy Lucy, Firecracker burger, \"chicken\" sandwich - I've never been disappointed by the food at Francis Burger Joint!",
      "date": "3 weeks ago",
      "source": "Google"
    },
    {
      "author": "Misty Perfetto Holland",
      "rating": 5,
      "text": "We came from Wisconsin for the weekend and we found Francis on google- searching for the top rated vegan restaurants. Husband and tried it tonight and we absolutely loved everything.  The burger and fried chicken sandwich we got were both so flavorful and cooked to perfection! (Juicy Lucy and Hunny Dijon Chicken Sandwich) Their shoestring fries were nice and hot and salty 😋\nSeveral members of their waitstaff came over to check on us, very attentive and friendly. Plus this place has a very cool, laid back vibe. We will definitely be coming back!\nPS- get a milkshake! 😋",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Kyle McCleary",
      "rating": 5,
      "text": "I've had good vegan burgers before so I tried one of the fried \"chicken\" sandwiches here to see if someone finally made and good one and they knocked it out of the park. By far the most chicken-like substitute I've ever had and this isn't coming from someone who hasn't had chicken in 20 years so they don't remember what it's like, I had some last week.",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Kass McCleary (Kass)",
      "rating": 5,
      "text": "My husband and I just had our first vegan restaurant experience here and it was awesome. The food was SO good. And the \"Kind of a Big Dill\" cocktail was what all of the State Fair pickle drinks should aspire to be!\n\nMy husband had the barbecutie chicken sandwich and was impressed by how meat-like it was. I had the elote burger - adored every bite!\n\nThe contactless option for ordering and paying was very convenient, and we got our food super quickly.\n\nWe'll definitely be going back.",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Brandon Sullivan",
      "rating": 5,
      "text": "Francis is FANTASTIC! It is perhaps too soon to call it, but I'm willing to say they are a modern legend for vegan comfort food.\n\nI love their burgers, their chicken sandwiches, their fries, and their milkshakes. They have good cocktails too, with a handful of nice mocktails to boot.\n\nI'm especially partial to the Francis burger and the fried Classic Chicken sandwich (plus spicy mayo). They often have fun special sandwiches, though sometimes one might be too busy with fixins to have a distinct personality.\n\nThe murals and furnishing and general vibe of this place is fantastic.\n\nI go to Francis way more often than I reasonably should.",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Joshua",
      "rating": 5,
      "text": "I am not vegan but this is probably the best vegan “chicken” sandwich I’ve tried. The seasoning was great and the texture of the “chicken” was pretty convincing as well. Fries were crispy and fresh. Service was outstanding! I also appreciate that this is a no tipping establishment (cost is built into the menu price). Would definitely return!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Nicholas Verderame",
      "rating": 5,
      "text": "My girlfriend was hungry and wanted ketchup. This was close by so we stopped in. It was right at the time happy hour began so we got some wine along with the Chicken Caesar Wrap and MN Spicy Chicken Sandwich which I got spicer. The fries were legit!",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Jordan E-B",
      "rating": 5,
      "text": "I’m neither vegan nor vegetarian, but these burgers are better than most meat burger joints i’ve been to. The chicken is not as convincing as I had been lead to believe, but the burger is all it takes for me to keep coming back.\nThe mixture of waitstaff/QR code independent ordering is sometimes bizarre, and leads to awkward bill splitting. It’s much more enjoyable in a very small group, ordering via QR code.",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Archibald Chuzzlewit",
      "rating": 5,
      "text": "First time visitor after being recommend by friends. Had the breakfast burger and it was great. I also think their fries are MUCH better than other places. Everything on the menu is plant based. Would absolutely recommend to everyone, whether vegetarian/vegan or not. Also had friendly staff and a cool vibe.",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "Deb Ellsworth",
      "rating": 5,
      "text": "Excellent food! The impossible burgers are char-grilled to perfection, with interesting choices, like the Juicy Lucy and the seasonal elite burger. Those in our party who got chicken sandwiches also thought they were excellent! Highly recommended!",
      "date": "5 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "REAL - From Apify-scraped Google reviews",
  "lastUpdated": "2026-02-05T23:22:56.391Z"
}