{
  "topProducts": [
    {
      "name": "Vegan Cheese Pizza",
      "description": "Pizza made with vegan cheese, considered one of the best in the city.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "They make some of the best vegan cheese pizza in the city"
      ]
    },
    {
      "name": "Vegan Pizza Bianca",
      "description": "A specific type of vegan pizza offered by the restaurant.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I’ve been getting a vegan pizza Bianca from Galactic since high school and recently started branching out- everything is just as good"
      ]
    },
    {
      "name": "Vegan Pasta",
      "description": "The restaurant offers vegan pasta options.",
      "category": "entree",
      "reviewMentions": 0,
      "badge": null,
      "quotes": []
    }
  ],
  "highlightedReviews": [
    {
      "author": "Ivy Winters",
      "rating": 5,
      "text": "I’ve been getting a vegan pizza Bianca from Galactic since high school and recently started branching out- everything is just as good!! This has been my go-to pizza place since and now that I live in the area my partner and I try to order it every Sunday. Best spinach artichoke dip I’ve ever had and the cheesecake is beyond as well. When I dine in it’s always super cozy and fun and they even had board games to play at the tables last time I went! Overall wonderful experience- we love galactic!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Brittany Jiménez",
      "rating": 5,
      "text": "Galactic Pizza is delicious! We really love the Paul Bunyan pizza, made with toppings native to MN. The Thailander is another favorite of ours. They have unique and tasty specialty pizzas, many of which can be made vegan or are vegan. We haven't tried their pasta, apps, or salads, but we did thoroughly enjoy the strawberry vegan cheesecake.\nPizza Luce is the popular local pizza joint, but after going to Galatic, we are definitely switching over to Galatic. Vegan cheese option, crust is sturdier so everything stays on when you pick up the slice, unique flavor combos, and friendly service. Can't recommend enough. Wish more people would go here so we can make sure it stays in business.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Gaige Steele",
      "rating": 5,
      "text": "this is the absolute best pasta and pizza i have had at a restaurant. there are tons of gluten-free, vegetarian, and vegan options. John really seems to care about his quality of food, and it shows. i got the pasta, and my girlfriend got the pizza, and we were both snagging bites from each other with how good it was. When i come back to Minnesota, this is a must stop.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Ashley Green",
      "rating": 5,
      "text": "They offer the best gluten free pizza crust I’ve ever had. Last year, I learned I can’t eat gluten anymore and it’s been really difficult finding restaurants that are both accommodating and put just as much love and energy into their GF options. Galactic does both.\n\nThey have a wide variety of options for everyone and that’s so rare and refreshing.\n\nIngredients taste fresh and it’s just great quality, yummy food that anyone can enjoy! The world needs more of this lol!\n\nI also have quite a few strictly vegan family members and it’s so good to be able to order truly fantastic pizza for everyone’s needs. Their Second Harvest Heartland is my favorite.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Jason Buchanan",
      "rating": 5,
      "text": "Vegetarian, Vegan, GF options for almost every pizza!\n\nvery friendly staff, and a very inviting environment. it feels nice and campy, this space travel decor and the extravagant-but-not-pretentious seating, wall treatments and ceiling elements are all having a lot of fun, but aren't pretending to be something they aren't. staff is all very down to earth, and the pizzas use all natural ingredients wherever possible. lots of options for many dietary choices.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Katie Carpenter",
      "rating": 5,
      "text": "Always a great time. Fun to watch the delivery drivers sneak out in their super hero attire. Many vegan, vegetarian and Gluten Free options. Local beers on tap. Variety of  Wisconsin based WiscoPop sodas, local ciders, LiftBridge root beer, wines, seltzers and beers available.\nItalian egg rolls are a must try! Muddy Paws cheesecakes and Cookie Cart desserts available.\nAlways fun, pleasant, courteous staff. Metered street parking or a paid parking lot about half a block away.\nBooks, games, puzzles and coloring available while you wait.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "BD Sevorg",
      "rating": 5,
      "text": "Wow! Best pizza I've had in Minneapolis. Thanks for having vegan and GF options to accommodate everyone. Can't wait to come back.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Abner Aguilar",
      "rating": 5,
      "text": "We love their crust and toppings! They offer regular marinara sauce and also San Marzano tomato sauce—which is great! We are strict vegans, and they offer plenty of options! The owner is very friendly and accommodating. I just wish parking was easier to find.",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Alicia Wright",
      "rating": 5,
      "text": "Fantastic, excellent, delicious. Lots of options for either regular or gluten-free or vegan diets. Have had it delivered a lot and this was the first time visiting in-person. Very nice staff. Lots of variety on the drinks menu. Pro-LGBT symbols throughout the establishment.",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Kate Christensen",
      "rating": 5,
      "text": "Staff were super lovely, music wasn't too loud (and was great 90's grunge/alternative), and the pizza was great. It was easy to find, the wait time wasn't too long, and I really appreciated the vegan options.",
      "date": "3 years ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:32:45.688Z"
}