{
  "topProducts": [
    {
      "name": "Tikka Masala (Chicken/Lamb)",
      "description": "A rich and smooth curry with a complex, balanced flavor of heat and spices. Praised as being one of the best. Portions are noted to be very generous, especially the chicken.",
      "category": "entree",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Naan (especially Garlic)",
      "description": "Fresh, delicious bread, perfect for dipping in curry. The garlic naan is frequently mentioned, and a coconut version was also praised.",
      "category": "side",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Lassi (Mango/Pistachio)",
      "description": "A refreshing yogurt-based drink. The mango lassi is described as refreshing, and the vegan pistachio lassi was called \"maybe the best drink ever\".",
      "category": "drink",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Biryani",
      "description": "A flavorful rice dish, noted for being full of flavor with generous portions of protein like lamb or paneer.",
      "category": "entree",
      "badge": "Top Pick",
      "quotes": [
        "Biryani is full of flavor, and the lamb is wonderful to bite into",
        "We got the biryani with paneer, new gen dhansak with vegetables, a mango lassi, & of course garlic naan",
        "We usually order the Chicken Biryani and the Rogan Josh, and it's 2"
      ],
      "reviewMentions": 4
    },
    {
      "name": "Samosas",
      "description": "A standout appetizer praised for its quality and flavor, especially when served with onion chutney. Both beef and vegetarian versions are mentioned.",
      "category": "appetizer",
      "badge": "Top Pick",
      "quotes": [
        "I HIGHLY recommend the beef samosas and garlic naan made fresh in house",
        "Samosas with onion chutney a huge standout in quality and flavor",
        "I love ordering Chicken Makni, samosas, and mango lassi"
      ],
      "reviewMentions": 8
    },
    {
      "name": "Palak Paneer",
      "description": "A well-seasoned and delicious spinach and cheese curry, described by one reviewer as the best they've had in the Twin Cities.",
      "category": "entree",
      "badge": "Popular",
      "quotes": [
        "It was the best Palak Paneer I have had in the Twin Cities",
        "Would highly recommend the Palak Paneer",
        "The Palak Paneer was ok"
      ],
      "reviewMentions": 3
    },
    {
      "name": "Lamb Rogan Josh",
      "description": "A curry praised for its flavor-packed gravy. The extra hot version has noticeable heat from ghost peppers.",
      "category": "entree",
      "badge": "Top Pick",
      "quotes": [
        "Lamb Rogan Josh or whatever they're calling it",
        "The lamb rogan josh here has a disturbing amount of garlic that made it Unedible",
        "Chana masala and lamb rogan josh r my favs"
      ],
      "reviewMentions": 4
    },
    {
      "name": "Korma",
      "description": "A creamy and aromatic curry dish. The lamb korma is mentioned specifically as a favorite from both the old and new versions of the restaurant.",
      "category": "entree",
      "badge": "Popular",
      "quotes": [
        "A pale shadow of the once great Gandi Mahal restaurant, which always had perfect Naan, and the best, aromatic and creamy Korma",
        "Love the lamb korma and the chicken makhni",
        "I love the Chicken Korma and samosas, which are bigger than my fist"
      ],
      "reviewMentions": 3
    }
  ],
  "highlightedReviews": [
    {
      "author": "Cynthia F",
      "rating": 5,
      "text": "My friends and I all felt the food was great! Had more depth of flavor than most Indian restaurants in the Twin Cities and more spicy. Also nice extra touches like a lime wedge and chopped fresh red onion on my Chana Saag.\n\nMy friends had the coconut curry chicken (YUM) and lamb Rogan Josh, and we had the pikayu and samosa for appetizers. Their green chutney is fantastic.\n\nOnly thing I didn't care for was the finishing salt on the appetizers, made them way too salty for my taste.\n\nThey do curry bowls which are a good deal and you can also order just curry (no rice) in two different sizes. They seem to do a lot of takeout business and I can see why, but the interior of the restaurant and the patio outside are both very nice for dining in. Service was great and the food came quickly.\n\nDefinitely recommend, I will be returning and also ordering takeout from here! I want to try their mango lassi next time, we were going out for dessert so I skipped it this time.\n\nThey are a no tipping establishment and charge a %15 fee. This is transparent on the menu. I'd prefer it just be included in the price of the food, but appreciate that it's specified. You order at the counter and they bring your food to your table.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Jessica Hayes",
      "rating": 5,
      "text": "Came back to try it under the new management. The food was delicious! It was the best Palak Paneer I have had in the Twin Cities. We also had Dal and Chicken Tikka Masala, and both were well-seasoned and delicious. The chicken was tender and the portions were large.  Naan was fresh and not tough at all. We live nearby, so we get takeaway, which was ready in fifteen minutes from ordering.  We are looking forward to being regular customers here again!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Jay Lyons",
      "rating": 5,
      "text": "We have been getting takeout somewhere between monthly and weekly from Curry in a Hurry since it opened in 2021.  We usually order the Chicken Biryani and the Rogan Josh, and it's 2.5-3 meals for each of us!  And so so flavorful!  I'm no expert on Indian/Bangladeshi food, but to me it's outstanding.  The only mistake we made was once ordering the Vindaloo.  We love hot food, but that was too much.  Probably just what some people are looking for!  The food is ALWAYS ready when I get there, and the staff are warm and friendly.  Curry in a Hurry is a Minneapolis treasure, just as its predecessor Gandhi Mahal was.  We miss the tandoor items but hopeful they will be back sometime!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Sarah",
      "rating": 4,
      "text": "When I saw this place was under new management I was excited and even more so after reading the new reviews. I ordered the same day. To my delight, the flavor did not disappoint, I was very pleased by the complexity and richness of the curry and that it was smooth which I love- unlike many other Indian restaurants that put diced tomato or peppers in theirs. The Naan was also delicious and fresh, I loved the option to add extra garlic. My only complaints are the amount of protein and the price. My husband and I love this food but unfortunately we can not afford to eat here at 70 dollars for two entrees and 2 orders of naan. We order through doordash as we don't have a car but as a dashpass member I am not paying extra fees, so we just pay tip which is about 4-5 dollars extra.. so it is about 67 before tip. This is way too expensive for us. I understand that you get a LOT of chicken/protein for this price but I find that the portion of is far too large. There is a TON of chicken in the Tikka Masala dinner, so much to the point that there's not enough space for curry. My husband gets the lamb tikka masala and has no problem finishing his, as there is not an overwhelming amount of meat like the chicken entree.\n\nFor me, the curry is my favorite part, more than the meat and I love dipping my naan in it and having lots of sauce to go with my rice.\nThe amount of chicken is so abundant that I make two or 3 meals out of one dinner but the curry doesnt last through each meal. I personally wish that there was a more reasonable portion of meat at a lower price that allowed for a better ratio of meat to curry. You could get away with half the amount of chicken.\nThis is the best tikka masala I have had since Ghandi Mahal and when I can splurge I certainly do and plan to continue being a loyal customer when finances allow.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Paul McLagan",
      "rating": 5,
      "text": "Before Curry in a Hurry, I loved going to Gandhi Mahal. When its location was lost in 2020, I was happy they set up this location and go as much as I can. It is my favorite \"Indian\" food restaurant. (The owners are Bangladeshi so it is technically more Bangladeshi fare). Indian food is usually good in regards to having great gluten free options and Curry in a Hurry is no different. In some ways I like the location and sitting outside during the summer to eat food.  I typically eat their Chicken Tika Masala but I have eaten their Chicken Vindaloo. Beware though with the Chicken Vindaloo. I consider myself to have a very high tolerance for hot food, but that Chicken Vindaloo has to be the most punishing spicy food I have ever had in the Twin Cities.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Chevy_in_quicksand",
      "rating": 5,
      "text": "I got the chicken makni and it was genuinely the best-tasting Indian food I've had in the cities.  It was VERY creamy and rich.  My friend got the vindaloo and was smacked in the face with *truly* spicy curry.  The taste of the chile was fresh and deep, and with raita, just barely manageable in spice, but I definitely preferred the makni, or my other friend's coconut curry, due to its richness and creaminess. I added some of the hot-hot sauce and a bit of raita to my makni.  The mango lassi was perfect and helped subdue the heat as, mind you, the heat level really is NO joke!  The hot sauce and the vindaloo were both 10/10 on your typical midwesterner's heat scale.  That's a very good thing that I value, though my one tiny complaint is that there might not have been enough warning about the vindaloo.  the gap in spice between this and the other curries I tried was massive. Anyways, back to gushing.\nThe atmosphere is super cozy thanks to the kind, smiling staff,  the music (apparently sometimes there's live music??), and the warm interior design that hugs you with deep red tones on one side and allows natural sunlight to dominate on the other.  For the $16 I paid, I got a full meal and almost a half of another!  This was a spur of the moment visit while I was nearby fishing at the river, and now I'm making plans to bring others here asap.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Melissa Hamilton",
      "rating": 5,
      "text": "We saw the tik tok, and we came! The food was top tier and the service was friendly and helpful. Greeted by the TikTok creator herself! She walked us through the menu and specials. We settled on the plantain pakoras with three sauces - tamarind, mint, onion chutney-all next level, Tikka masala with its nice balance of heat and spices, tandoori wings, masala fries, and a delicious pistachio lassi! We purposefully chose many items to try. We will definitely be returning often!! 🔥💕",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "allie whoops",
      "rating": 5,
      "text": "Updated 12/2025: this new generation knows what they’re doing!! I’ve been coming here for years, and this has been my favorite chapter to date. The flavors are bolder, the spice has been watched up a notch, and everything just has a little ~something~ extra.\n\nI’ve been loving all the new menu items, as well as the classics - everything I’ve tried has been absolutely delicious and I can’t wait to work my way down the list. Curry in a hurry will stay on heavy rotation for me!\n\nOld review: Everyone is always so friendly! I try and stop in on a weekly basis, especially in the summer when I can enjoy the patio ♥️ such a wonderful neighborhood establishment. Love the lamb korma and the chicken makhni!",
      "date": "Edited a month ago",
      "source": "Google"
    },
    {
      "author": "Leif Moser",
      "rating": 5,
      "text": "I was relieved to be able to get curry just up the street again. The new menu had curry heat options so I ordered hot, just as I would most anywhere else.\n\nI picked up the meal and learned that they were doing a tiktok reaction (challenge?) for those willing to order hot or extra hot curry. While I don't use tiktok personally, I wanted to write a review about the actual experience of eating the hot option for my mango chicken curry.\n\nI consider my spice tolerance to be fair so I was interested to see exactly why they were asking for reaction videos. My first bite was without any rice and I could tell immediately that the heat level was much higher than I was expecting. Certainly not melt my face off spicy, but it took maybe one minute before I began to sweat, a few minutes before I had some tears welling up in my eyes, and by the time I was finished with half the portion (got full, it was a hefty portion!), my sinuses were cleared up. This heat level was intense but manageable, and high enough to make the pain from the experience mildly euphoric. Note: I ordered hot, and there is a level above this.\n\nKnowing what I know now, I will probably order medium unless I have a bad head cold or a case of the Sunday scaries requiring medicinal capsaicin levels.\n\nThe food was flavorful and hit the spot. Very glad it's open again! Excited to try the other offerings.",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Cammie Hardouin",
      "rating": 5,
      "text": "This is currently my favorite Indian restaurant in and around Minneapolis because of the flavors of the food. They utilize wonderful techniques with quality ingredients. The spices are so fresh and abundant that it's a real delight. We tried the lassi, huge samosas, biryani, curry, and dal. I hope to return soon and try more because I expect everything to be incredibly delicious here. They have live music on Friday and Saturday nights. They use environmentally friendly containers and bags. I can't recommend this place enough.",
      "date": "a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "REAL - From Apify-scraped Google reviews",
  "lastUpdated": "2026-02-06T00:16:32.964Z"
}