{
  "topProducts": [
    {
      "name": "Plantain Pakoras",
      "description": "Served with three sauces - tamarind, mint, and onion chutney.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We settled on the plantain pakoras with three sauces - tamarind, mint, onion chutney-all next level, Tikka masala with its nice balance of heat and spices, tandoori wings, masala fries, and a delicious pistachio lassi"
      ]
    },
    {
      "name": "Masala Fries",
      "description": "Fries seasoned with masala spices.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We settled on the plantain pakoras with three sauces - tamarind, mint, onion chutney-all next level, Tikka masala with its nice balance of heat and spices, tandoori wings, masala fries, and a delicious pistachio lassi"
      ]
    },
    {
      "name": "Vegan Pistachio Lassi",
      "description": "A vegan version of a pistachio lassi, described as possibly the best drink ever.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Vegan pistachio lassi maybe the best drink ever"
      ]
    },
    {
      "name": "Samosas with onion chutney",
      "description": "A standout in quality and flavor, served with onion chutney.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Samosas with onion chutney a huge standout in quality and flavor"
      ]
    },
    {
      "name": "Chana Saag",
      "description": "A very tasty dish made with chickpeas and spinach.",
      "category": "entree",
      "reviewMentions": 3,
      "badge": "Popular",
      "quotes": [
        "Chana saag very tasty",
        "Other recommendations are the tofu coconut curry, chana saag and lentil piyaju",
        "Also nice extra touches like a lime wedge and chopped fresh red onion on my Chana Saag"
      ]
    },
    {
      "name": "Coconut Naan",
      "description": "A really good naan bread with coconut.",
      "category": "appetizer",
      "reviewMentions": 3,
      "badge": "Popular",
      "quotes": [
        "The coconut naan was really good as well",
        "Please support this great restaurant so they can get their oven back up and running to make their coconut naan again (lost the original in a fire)",
        "And this is the only place I have seen that has coconut naan"
      ]
    },
    {
      "name": "Vegan Dessert",
      "description": "A vegan dessert was offered for free upon request.",
      "category": "dessert",
      "reviewMentions": 0,
      "badge": null,
      "quotes": []
    },
    {
      "name": "Bazi",
      "description": "A dish with a Bangla twist and a delicious unique tangy spice profile.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I also appreciate the Bangla twist on several dishes (the Bazi was awesome and had a delicious unique tangy spice profile), they were delicious and really set the restaurant apart from other South Asian restaurants in the area"
      ]
    },
    {
      "name": "New Gen Dhansak with Vegetables",
      "description": "A dhansak dish made with vegetables.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We got the biryani with paneer, new gen dhansak with vegetables, a mango lassi, & of course garlic naan"
      ]
    },
    {
      "name": "Daal",
      "description": "A lentil curry dish.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": []
    }
  ],
  "highlightedReviews": [
    {
      "author": "J J",
      "rating": 5,
      "text": "This was my first time here, I’ve passed by it before in traffic and I’ve always wanted to stop by. I’m glad I did. I found out it was their first week under new ownership.\n\nThe food was amazing, I ordered the extra hot Lamb Rogan Ghoshtak. The gravy was packed with flavor. The ghost peppers were noticeable. The coconut naan was really good as well.\n\nI got handed a free dessert, when I asked if it was vegan to share it with my partner they gave me a second vegan one for free.\n\nGreat food, great hospitality, and owners that seem like they care. I’ll definitely be back!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Peter Brylow",
      "rating": 5,
      "text": "An excellent experience dining in at curry in a hurry. Samosas with onion chutney a huge standout in quality and flavor. Chana saag very tasty! Vegan pistachio lassi maybe the best drink ever.",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Kailyn Schmitt",
      "rating": 5,
      "text": "So happy to have this place in my neighborhood. Quick, tasty, easy, good portion sizes, lots of vegan / vegetarian options! Best take-out option around for sure.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Michael Cully",
      "rating": 5,
      "text": "Wow, incredible! Ive tried every Indian restaurant you could think of in the twin cities area and the food here is the best ive had. Very authentic taste and spice. I usually get hot every other place and it's not hot enough but here the medium is plenty hot for spice level. The girl working was super amazing.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Sarah",
      "rating": 4,
      "text": "When I saw this place was under new management I was excited and even more so after reading the new reviews. I ordered the same day. To my delight, the flavor did not disappoint, I was very pleased by the complexity and richness of the curry and that it was smooth which I love- unlike many other Indian restaurants that put diced tomato or peppers in theirs. The Naan was also delicious and fresh, I loved the option to add extra garlic. My only complaints are the amount of protein and the price. My husband and I love this food but unfortunately we can not afford to eat here at 70 dollars for two entrees and 2 orders of naan. We order through doordash as we don't have a car but as a dashpass member I am not paying extra fees, so we just pay tip which is about 4-5 dollars extra.. so it is about 67 before tip. This is way too expensive for us. I understand that you get a LOT of chicken/protein for this price but I find that the portion of is far too large. There is a TON of chicken in the Tikka Masala dinner, so much to the point that there's not enough space for curry. My husband gets the lamb tikka masala and has no problem finishing his, as there is not an overwhelming amount of meat like the chicken entree.\n\nFor me, the curry is my favorite part, more than the meat and I love dipping my naan in it and having lots of sauce to go with my rice.\nThe amount of chicken is so abundant that I make two or 3 meals out of one dinner but the curry doesnt last through each meal. I personally wish that there was a more reasonable portion of meat at a lower price that allowed for a better ratio of meat to curry. You could get away with half the amount of chicken.\nThis is the best tikka masala I have had since Ghandi Mahal and when I can splurge I certainly do and plan to continue being a loyal customer when finances allow.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Jessica Hayes",
      "rating": 5,
      "text": "Came back to try it under the new management. The food was delicious! It was the best Palak Paneer I have had in the Twin Cities. We also had Dal and Chicken Tikka Masala, and both were well-seasoned and delicious. The chicken was tender and the portions were large.  Naan was fresh and not tough at all. We live nearby, so we get takeaway, which was ready in fifteen minutes from ordering.  We are looking forward to being regular customers here again!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Cammie Hardouin",
      "rating": 5,
      "text": "This is currently my favorite Indian restaurant in and around Minneapolis because of the flavors of the food. They utilize wonderful techniques with quality ingredients. The spices are so fresh and abundant that it's a real delight. We tried the lassi, huge samosas, biryani, curry, and dal. I hope to return soon and try more because I expect everything to be incredibly delicious here. They have live music on Friday and Saturday nights. They use environmentally friendly containers and bags. I can't recommend this place enough.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Eric Severson",
      "rating": 5,
      "text": "Used to be Gandhi Mahal, New location and updated name. This place is one of my favorite Indian places in the twin cities. This last time we got two samosas which were absolutely delicious. The crust on the outside of them were crispy and Flaky and fantastic. Highly recommend the Rogan Josh if you like lamb. And this is the only place I have seen that has coconut naan. I've seen multiple different flavors at other Indian restaurants but for some reason this one is the only one that makes delicious coconut Naan. Ghandi Mahal had issues with inconsistent portion sizes...this place has portions down on lock. And this place is a no tip establishment. Couldn't believe that the first time I ordered!",
      "date": "Edited a year ago",
      "source": "Google"
    },
    {
      "author": "Paul McLagan",
      "rating": 5,
      "text": "Before Curry in a Hurry, I loved going to Gandhi Mahal. When its location was lost in 2020, I was happy they set up this location and go as much as I can. It is my favorite \"Indian\" food restaurant. (The owners are Bangladeshi so it is technically more Bangladeshi fare). Indian food is usually good in regards to having great gluten free options and Curry in a Hurry is no different. In some ways I like the location and sitting outside during the summer to eat food.  I typically eat their Chicken Tika Masala but I have eaten their Chicken Vindaloo. Beware though with the Chicken Vindaloo. I consider myself to have a very high tolerance for hot food, but that Chicken Vindaloo has to be the most punishing spicy food I have ever had in the Twin Cities.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "allie whoops",
      "rating": 5,
      "text": "Updated 12/2025: this new generation knows what they’re doing!! I’ve been coming here for years, and this has been my favorite chapter to date. The flavors are bolder, the spice has been watched up a notch, and everything just has a little ~something~ extra.\n\nI’ve been loving all the new menu items, as well as the classics - everything I’ve tried has been absolutely delicious and I can’t wait to work my way down the list. Curry in a hurry will stay on heavy rotation for me!\n\nOld review: Everyone is always so friendly! I try and stop in on a weekly basis, especially in the summer when I can enjoy the patio ♥️ such a wonderful neighborhood establishment. Love the lamb korma and the chicken makhni!",
      "date": "Edited a month ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:35:51.174Z"
}