{
  "topProducts": [
    {
      "name": "Vegan Donuts",
      "description": "A large selection of vegan donuts that are frequently praised for tasting like traditional donuts, although some reviews mention they can be dense or dry.",
      "category": "Dessert",
      "badge": "Top Pick",
      "quotes": [
        "My first time coming I was refered by a friend since going vegan and had a taste for a donut; I got two of each of 4 vegan donuts selections (Vanilla Starlet, orange, ginger & cinnamon infused glaze, Sugar Kane (vanilla glaze), and a vegan strawberry), so 8 donuts total",
        "Top tier vegan donuts that taste just like normal ones and the service is great",
        "Vegan donuts changed my life"
      ],
      "reviewMentions": 6
    },
    {
      "name": "Bananaramma",
      "description": "A specific donut flavor mentioned as a favorite by customers.",
      "category": "Dessert",
      "badge": "Featured",
      "quotes": [
        "We loved all of the options we brought home but especially the bananaramma, the caramel apple cheesecake and the chocolate w/ salted caramel"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Caramel Apple Cheesecake Donut",
      "description": "A unique and favored donut flavor highlighted in reviews.",
      "category": "Dessert",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Chocolate with Salted Caramel Donut",
      "description": "A highly-rated donut with a combination of chocolate and salted caramel.",
      "category": "Dessert",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Coffee & Lattes",
      "description": "Numerous coffee and latte options, including seasonal flavors like Snickerdoodle Latte. Some specialty lattes receive mixed reviews.",
      "category": "Drink",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Femme Fatale",
      "description": "A specific donut variety available for purchase, mentioned as part of an assorted selection.",
      "category": "Dessert",
      "badge": "Popular",
      "quotes": [
        "My First Time Ordering Through Glam Doll Donuts In Minneapolis MN With DoorDash\nI Got Some Half Dozen Assorted Dark Angel\nFemme Fatale,Misfit And Chocolate Starlet And My Drink Was Strawberry Malt Shake",
        "The Misfit and the femme fatale were out of this world"
      ],
      "reviewMentions": 2
    },
    {
      "name": "Misfit",
      "description": "A named donut variety that is part of the assorted options offered.",
      "category": "Dessert",
      "badge": "Popular",
      "quotes": [
        "My First Time Ordering Through Glam Doll Donuts In Minneapolis MN With DoorDash\nI Got Some Half Dozen Assorted Dark Angel\nFemme Fatale,Misfit And Chocolate Starlet And My Drink Was Strawberry Malt Shake",
        "The Misfit and the femme fatale were out of this world",
        "We got the vegan misfit and a non-vegan glazed, and both were dry on the inside and the icing/glaze on both cracked and fell off"
      ],
      "reviewMentions": 3
    },
    {
      "name": "Strawberry Donut",
      "description": "A classic donut flavor noted for its croissant-like texture and rich, frosting-like topping.",
      "category": "Dessert",
      "badge": "Featured",
      "quotes": [
        "Their dirty chai is to die for, along with the strawberry donut"
      ],
      "reviewMentions": 1
    }
  ],
  "highlightedReviews": [
    {
      "author": "Chris Montan",
      "rating": 5,
      "text": "Love the outside of the store with its pretty pink facade. We found this place after visiting Children's Minneapolis for a dr visit. We were welcomed so warmly as soon as we walked in and enjoyed the vast array of unique donut flavors offered including vegan options. You can tell that the bakery and staff are very supportive of the city which is something that always makes me happy. We hemmed and hawed over a couple flavors because there were so many good options that it was tough to decide. The lovely lady that was helping us made sure that was not a problem and gave us two free donuts on top of the half dozen we ended up paying for. We loved all of the options we brought home but especially the bananaramma, the caramel apple cheesecake and the chocolate w/ salted caramel. We'll be back again in the future without a question.",
      "date": "3 weeks ago",
      "source": "Google"
    },
    {
      "author": "WyldWeezle",
      "rating": 5,
      "text": "First time back to MN in more than 10 years, STILL amazing!\nI didn't think to ask her name (She made the model donut shop in the glass box on the wall), but our server was friendly and awesome. Had a Pecan Scotchie, a Calendar Girl, half of my wife's Showgirl, and hot chocolate. EPIC! Go! Eat donuts!",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Kristen Costello",
      "rating": 5,
      "text": "The donuts and coffee selections were numerous and tasty! Shout out to the seasonal Snickerdoodle Latte. That pumpkin donut makes me feel sorry for every other donut. They have vegan versions, which is dope for folks with unique dietary needs.\n\nThe service and atmosphere were outstanding. The folks working are happy, kind, and funny. Making conversation and singing along while we made our tough choices. You felt welcomed instantly and left in a lighter spirit (though maybe not a lighter weight 😅).",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Chanthy And Tina Taem",
      "rating": 5,
      "text": "My First Time Ordering Through Glam Doll Donuts In Minneapolis MN With DoorDash\nI Got Some Half Dozen Assorted Dark Angel\nFemme Fatale,Misfit And Chocolate Starlet And My Drink Was Strawberry Malt Shake. Definitely Will Come Back Again To Glam Doll Donuts.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Mitchell Mudd",
      "rating": 5,
      "text": "Incredible vegan selection!! Grabbed all 7 vegan options and we really liked all of them. Only thing we found odd was how dense they were for yeast donuts. It wasn't bad, but we had some airier ones in Portland, and I think that would be nice to have here as well. The inside was cute and it wasn't busy when we were there. The people working there were nice.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Shay Hale",
      "rating": 5,
      "text": "The atmosphere of this place is certainly worth the visit alone. It's a great experience from start to finish and I couldn't seem to look away from the 50s interior paired with the vintage items, but I was captivated by the paintings.\nThe donuts had a ton of options, with a bunch of really fun flavors. I had to go with a classic to kinda get a good feel for the place before I got a fancy flavor. So strawberry it was! Which the donut itself was awesome, loved the croissant texture to it.\nThe one thing I would say about this place is the donuts are really rich. The toppings remind me more of frosting than of glaze. I hope to be back, but next time I'll certainly be grabbing a coffee to even put the sweet.\n\nOther than that the staff seemed friendly, and there were lots of vegan options. So I would recommend this place.",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Don Dude",
      "rating": 5,
      "text": "Iconic artisan donut shop and  arguably the one kinda re-invented and drive donuts back into 'mainstream'.\nThese are not your grandma's donuts, unless your Grandma was the Salvadore Dahli of the Donut world!  😉\nVery high quality ingredients and wonderfully cooked and perfect textures!  many decadent signatures like salted caramel chocolate.  A huge range of flavor profiles and good range of Vegan options.\nFun ecclectic artsy shop to match the creativeness of the product!\nGreat coffee and other beverages as well.\nLove it!  If you are in town, absolutely take a little time to check it out!",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "KayDee Bakken",
      "rating": 5,
      "text": "The selection of donut flavors, vegan and regular are phenomenal. We walked in and all three people behind the counter greeted us with smiles and “good mornings.” They were very patient with us, answered all our questions and orders. Their dirty chai is to die for, along with the strawberry donut. Will be back, much love🫶🏻",
      "date": "8 months ago",
      "source": "Google"
    },
    {
      "author": "Ryan Sweet",
      "rating": 5,
      "text": "Everyone else is right. The donuts and building are great. Retro and kitschy but most of all fun. If you’re reading this review trying to decide if you should go. Do it. Highly endorse. I had the OG and the vegan donuts. Both great. Vegan donut was a little more dense, but ultimately just as good as the others.\n\nIf you’re the owner/manager/staff reading this. Great job. Thank you! The staff the morning of Mar 22 ‘25 could not have been better. Helpful, funny, thoughtful and cool! Any business would be lucky to have them.",
      "date": "10 months ago",
      "source": "Google"
    },
    {
      "author": "Anna Wilson",
      "rating": 5,
      "text": "Vegans like donuts too!! 🫶🏾 Thank you for including us! I’ve been a patron of this place for years and the donuts are always delicious and the service is always super friendly. They are particularly aware and helpful of any type of food preference or allergy, offering things like separate boxes for non-dairy or nuts etc. While I usually get mine to go, the funky, bright atmosphere inside always makes you want to stay and hang out. Thank you for being inclusive in all the ways 🍩🏳️‍🌈",
      "date": "a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "REAL - From Apify-scraped Google reviews",
  "lastUpdated": "2026-02-05T23:50:01.296Z"
}