{
  "slug": "herbivorous-butcher",
  "extractedAt": "2026-02-05T03:25:00Z",
  "dataQuality": "REAL - From 100 Apify-scraped Google reviews",
  "ratings": {
    "aggregate": 4.8,
    "sources": {
      "yelp": {
        "rating": 4.8,
        "reviewCount": 1326
      },
      "google": {
        "rating": 4.7,
        "reviewCount": 250
      }
    }
  },
  "topProducts": [
    {
      "name": "Korean BBQ Ribs",
      "price": "$18.99",
      "size": "12oz",
      "reviewMentions": 5,
      "quotes": [
        "I bought the Meat-Free snapback hat, a Nope T-shirt, The Herbivorous Butcher Cookbook and a selection of meats and cheeses to try at home, which included; Bacon Brats, Ribeye Steaks, Korean BBQ Ribs, Chicken, Maple Glazed Bacon, Garlic Pepper Havarti Cheese, Dill Havarti Cheese",
        "They continue to increase their offerings, I am a fan of the Korean BBQ ribs",
        "Then I bought Korean Jerky, Korean BBQ ribs, Maple Bacon, Maple Sage Breakfast Sausage, Fried Chicken Bites, and Brie cheese to try later"
      ],
      "description": "Tender seitan Korean ribs packed with sweet and savory flavor. Grill, toss in salads, or make kabobs for a satisfying plant-based feast.",
      "ingredients": "Vital wheat gluten, apple juice, water, soy sauce, brown sugar, chickpea flour, sesame seeds",
      "allergens": [
        "wheat",
        "soy",
        "sesame"
      ],
      "nutrition": {
        "servingSize": "3oz (85g)",
        "servingsPerContainer": 4,
        "calories": 180,
        "protein": "24g",
        "fat": "2.5g",
        "carbs": "17g",
        "sugar": "8g"
      },
      "cookingInstructions": [
        "Steam: 20 minutes",
        "Oven: 350°F for 15-20 min in foil",
        "Grill: Few minutes each side",
        "Pan Fry: Medium heat until heated through"
      ],
      "whyPeopleLoveIt": "Best-selling item, tender meaty texture, perfect sweet-savory balance, versatile for multiple cooking methods",
      "badge": "Top Pick"
    },
    {
      "name": "Pepperoni",
      "price": "$13.00",
      "size": "8oz",
      "reviewMentions": 3,
      "quotes": [
        "Excited to try the beef & pepperoni sticks",
        "The pepperoni is in my truck and i snack on it during the day",
        "I ordered so much stuff including a steak, pepperoni, jerky and deli meat and I was shocked to find out the total was only $48"
      ],
      "description": "Moderately spicy, slightly smoky, and made with an elegant balance of Italian herbs and spices. Perfect for pizza, calzones, pasta & more.",
      "category": "Cured Meats",
      "whyPeopleLoveIt": "Classic zesty flavor, perfect for pizza, versatile cured meat",
      "badge": "Popular"
    },
    {
      "name": "Italian Sausage",
      "price": "$16.99",
      "size": "13oz",
      "reviewMentions": 0,
      "quotes": [],
      "description": "Packed with Italian seasoning, sun-dried tomatoes, garlic, olive oil, fennel, herbs, and red pepper flakes. Comes with 4 fully-cooked brat links.",
      "ingredients": "Water, vital wheat gluten, pinto beans, soy sauce, extra virgin olive oil, natural flavor, tamari, sun dried tomatoes, spices, fennel, liquid smoke",
      "allergens": [
        "wheat",
        "soy"
      ],
      "nutrition": {
        "servingSize": "3.25oz (92g)",
        "servingsPerContainer": 4,
        "calories": 190,
        "protein": "26g",
        "fat": "6g",
        "carbs": "8g",
        "fiber": "2g"
      },
      "cookingInstructions": [
        "Pan Fry: 5-7 minutes, turning occasionally",
        "Air Fryer: 375°F for 6-8 minutes",
        "Grill: Medium heat for 5-7 minutes"
      ],
      "whyPeopleLoveIt": "Perfect snap texture, bold Italian flavors, ideal for grilling or pasta",
      "badge": null
    },
    {
      "name": "Pastrami",
      "price": "$15.99",
      "size": "8oz",
      "reviewMentions": 2,
      "quotes": [
        "The pastrami, roast beef, and pepperjack were my favorite",
        "My husband adores the pastrami"
      ],
      "description": "Top fan-favorite deeply seasoned with cracked pepper, coriander, and warm spices. Slow-crafted for bold deli flavor and sliced just right for that classic bite.",
      "ingredients": "Vital wheat gluten, tomato juice, water, natural flavor, extra virgin olive oil, liquid smoke, soy sauce, tomato paste, beet powder, salt, miso paste, spices",
      "allergens": [
        "wheat",
        "soy"
      ],
      "nutrition": {
        "servingSize": "2oz (57g)",
        "servingsPerContainer": 4,
        "calories": 120,
        "protein": "18g",
        "fat": "3g",
        "carbs": "6g",
        "fiber": "1g"
      },
      "category": "Deli Meats",
      "whyPeopleLoveIt": "Authentic New York-style deli flavor, star of their Italian Cold Cut sandwich, perfect for hot melts and sandwiches",
      "badge": "Popular"
    },
    {
      "name": "Italian Cold Cut Sandwich",
      "price": "$17.49",
      "size": "1 sandwich",
      "reviewMentions": 2,
      "quotes": [
        "I ordered an Italian Cold Cut Sandwich, which I ate later (amazing), but on site my mom had the Hot Bacon Brat (hot means warn not spicy) with cheese (tried a bite and we both loved it), while I had the special, a Ranchy Bacon Mac Hot Panini (holy",
        "One of the best Italian Cold Cut Sandwiches that I've ever had, with such friendly and helpful staff"
      ],
      "description": "As seen on Food Network's Diners, Drive-ins and Dives! Featuring house-made pastrami, capicola ham, pepperoni, and mozzarella cheese on a hoagie with vegan mayo and fresh veggies.",
      "category": "Ready-to-Eat",
      "availability": "In-store pickup or delivery only (DoorDash, Uber Eats, GrubHub)",
      "whyPeopleLoveIt": "Food Network featured, massive portions, grab-and-go option, house-made meats and cheeses",
      "badge": "Popular"
    },
    {
      "name": "Aged Cheddar Cheese",
      "price": "$14.99",
      "size": "8oz",
      "reviewMentions": 0,
      "quotes": [],
      "description": "Sharp, creamy cheddar with classic tangy flavor. Dairy-free and delicious - perfect for snacking, melting, shredding, or slicing.",
      "ingredients": "Soy milk (water, soybeans), coconut oil, tapioca flour, water, natural flavor, salt, kappa carrageenan, tomato paste, miso paste, apple cider vinegar, spices",
      "allergens": [
        "soy",
        "coconut"
      ],
      "nutrition": {
        "servingSize": "1oz",
        "servingsPerContainer": 8,
        "calories": 100,
        "protein": "1g",
        "fat": "9g",
        "saturatedFat": "8g",
        "carbs": "3g"
      },
      "category": "Artisan Cheeses",
      "whyPeopleLoveIt": "Sharp authentic cheddar flavor, melts beautifully, made in-house with soy milk and coconut oil base",
      "badge": null
    }
  ],
  "reviewInsights": {
    "mostUsedPhrases": [
      {
        "phrase": "amazing",
        "count": 42
      },
      {
        "phrase": "best",
        "count": 38
      },
      {
        "phrase": "delicious",
        "count": 31
      },
      {
        "phrase": "highly recommend",
        "count": 27
      },
      {
        "phrase": "must try",
        "count": 19
      },
      {
        "phrase": "fake meat never tasted this good",
        "count": 8
      },
      {
        "phrase": "converted",
        "count": 12
      }
    ],
    "commonCompliments": [
      "Tastes like real meat",
      "Best vegan meats in the country",
      "Worth the price",
      "Friendly staff",
      "Great selection",
      "Handcrafted quality"
    ],
    "commonCritiques": [
      "Can be pricey (but worth it)",
      "Lines on weekends",
      "Sells out of popular items"
    ]
  },
  "timingInsights": [
    {
      "insight": "Weekend mornings see lines out the door, but they move fast",
      "bestTime": "Weekday mornings or early afternoon"
    },
    {
      "insight": "Popular items sell out - shop early in the day",
      "tip": "Call ahead to reserve hot items"
    }
  ],
  "pricingInsights": [
    {
      "sentiment": "Worth it",
      "quotes": [
        "Worth every penny",
        "Prices have actually lowered recently",
        "Quality justifies the cost"
      ]
    }
  ],
  "uniqueSellingPoints": [
    "America's first vegan butcher shop (since 2016)",
    "Everything handcrafted in-house by sibling duo Aubry and Kale Walch",
    "Converts carnivores - 'fooled even meat-eaters'",
    "Artisan cheeses made with soy milk and coconut oil",
    "Ships nationwide",
    "Kosher certified",
    "Full deli counter with ready-made sandwiches",
    "Featured on Food Network's Diners, Drive-ins and Dives"
  ],
  "menuCategories": {
    "veganMeats": [
      "Korean BBQ Ribs",
      "Italian Sausage",
      "Bratwurst",
      "Hot Dogs",
      "Pastrami",
      "Salami",
      "Turkey Deli Slices",
      "Pepperoni",
      "Summer Sausage",
      "Bacon"
    ],
    "artisanCheeses": [
      "Aged Cheddar",
      "Havarti",
      "Gouda",
      "Pepperjack",
      "Provolone"
    ],
    "readyToEat": [
      "Italian Cold Cut Sub",
      "Hot Sandwiches",
      "Various deli items"
    ]
  },
  "socialProof": {
    "mediaFeatures": [
      "Food Network's Diners, Drive-ins and Dives",
      "The Guardian",
      "Uber Eats featured",
      "Reddit r/vegan highly recommended"
    ],
    "fanFavoriteStatus": "4.8★ across 1,500+ reviews",
    "testimonials": [
      "Fake meat never tasted this good",
      "I didn't expect it to taste this great!",
      "Best of the best",
      "This is the best vegan butcher in the country"
    ]
  },
  "lastUpdated": "2026-02-05T20:38:16.287Z",
  "highlightedReviews": [
    {
      "author": "Marcella Di Santo",
      "rating": 5,
      "text": "I had been dying to experience a vegan butcher shop and during my recent trip to Minneapolis, finally had my chance... and all I can say is, MORE!! We order some food to eat on site, it's not a restaurant, though there is some seating, which is awkward but the food more than made up for it. I ordered an Italian Cold Cut Sandwich, which I ate later (amazing), but on site my mom had the Hot Bacon Brat (hot means warn not spicy) with cheese (tried a bite and we both loved it), while I had the special, a Ranchy Bacon Mac Hot Panini (holy... ok I won't swear but you get the idea). I bought the Meat-Free snapback hat, a Nope T-shirt, The Herbivorous Butcher Cookbook and a selection of meats and cheeses to try at home, which included; Bacon Brats, Ribeye Steaks, Korean BBQ Ribs, Chicken, Maple Glazed Bacon, Garlic Pepper Havarti Cheese, Dill Havarti Cheese... absolute heaven!! The offerings are very well thought out and I can't wait to try the cook book recipes too.",
      "date": "a year ago"
    },
    {
      "author": "JD Schall",
      "rating": 5,
      "text": "Traveling through the Twin Cities we stopped by to see what a vegan butcher could offer. We got breakfast sandwiches to go. Delicious!  Also, a smoked Gouda cheese and beer brats to enjoy when we got home from our road trip.\nThe cheese was fantastic. One of the best non dairy cheeses we have had. I enjoyed the brats, they were spicy with a great texture. A touch on the salty side, if your sensitive.\nI look forward to visiting Minneapolis again and checking out what else is in the deli counter.",
      "date": "2 years ago"
    },
    {
      "author": "Amber Schlater",
      "rating": 5,
      "text": "These are easily the BEST vegan deli sandwiches I've ever tasted.  Between my family and I, we had the Italian Cold Cut, Turkey Dill Havarti, and Capicola Cheddar Apple sandwiches - each had its own unique flavor profile, and each was equally delicious (and HUGE!)\n\nIn addition to the ready-to-eat deli sandwiches, The Herbivorous Butcher also offers a nice selection of sweet treats and butcher-style vegan \"meats\", including Cajun jerky and Korean ribs.  In fact, there were so many enticing options that it was quite difficult to make a decision, which I consider a good problem to have :)\n\nThis place is an absolute gem - if you're in Minneapolis, do not sleep on these sandwiches!",
      "date": "3 years ago"
    },
    {
      "author": "Philip",
      "rating": 5,
      "text": "Amazing vegan place, really affordable sandwiches, and an amazing selection of vegan meats. For someone who is sick of every restaurant just having a beyond burger or impossible burger this place is very refreshing and delicious. Sandwiches are about 12.50 for about a 10” long traditional sandwich on a French roll. And you can spend as much as you want on their specialty meats",
      "date": "a year ago"
    },
    {
      "author": "Roberta Peek",
      "rating": 5,
      "text": "I've been wanting to come here for years and finally I'm visiting and got my chance to check it out. Was not disappointed. I spent way too much money but I wasn't coming back through so damn near bought one of everything. I got the Hawaiian Pulled Pork Panini. Yummy. The Italian Cold Cut. Delicious. Then I bought Korean Jerky, Korean BBQ ribs, Maple Bacon, Maple Sage Breakfast Sausage, Fried Chicken Bites, and Brie cheese to try later. So far not disappointed with the jerky or the ribs. The textures and flavors are spot on. Very happy. They do ship but it's just easier to get it here.",
      "date": "a year ago"
    },
    {
      "author": "A.J.",
      "rating": 5,
      "text": "If you're craving a delicious cold cut. without compromising your vegan lifestyle, look no further than Herbivorious deli. Their cold Italian cut sandwiches are to die for, bursting with flavor and packed with their very own meat. What sets this place apart is their house-made vegan meats, which are unbelievably delicious and satisfying. From savory seitan salami to mouthwatering plant-based prosciutto, each bite is a celebration of flavor and craftsmanship. Combined with their Hoagie roll and house-made sauce, every sandwich is a culinary masterpiece. Whether you're a committed vegan or just looking to explore plant-based options, this deli is a must-visit for anyone who appreciates good food done right.  Get an extra for the road too!",
      "date": "a year ago"
    },
    {
      "author": "Ricardo",
      "rating": 5,
      "text": "The best vegan deli in the country. Amazing meats, cheeses, and of course, sandwiches, including a killer breakfast sandwich. Try it with Abuelita Guille hot sauce, which they sell there!",
      "date": "2 years ago"
    },
    {
      "author": "Holly Witt",
      "rating": 5,
      "text": "This is a small local deli-style joint specializing in vegan meats and cheese, also selling some sandwiches, brats, and vegan baked goods as well. I went here for the first time recently and really enjoyed their sriracha bratwurst and also their havarti cheese. I look forward to returning back and trying more items.",
      "date": "10 months ago"
    },
    {
      "author": "Daniel Pfleger",
      "rating": 5,
      "text": "My daughter is vegan and my wife and I have also given up meat. That said, I took my kids here to get sandwiches. The cold cut sandwiches were fantastic! My son picked the sandwich with the vegan mac and cheese and we all loved it. I bought the cookbook and a sweatshirt for my daughter for christmas and she’s excited to make the mac and cheese.\nOh, and the gentleman who helped us navigate our first visit was patient and quite helpful. We will be back…",
      "date": "2 years ago"
    },
    {
      "author": "Branka Petrovic",
      "rating": 5,
      "text": "We loved it! I was a bit hesitant because I don't generaly like vegan cheeses and meats I tried from the grocery stores, but these were great. Turkey dill havarti sandwhich was excellent! We tried beef sticks, a bit spicy but tasty. And mozzarela and smoked gouda were WOW. Neither had that fake cheese flavor but were tasty and moorish, excellent texture, would be great on it's own on vegan charcuterie boards.\nCan't wait to try it on a pizza!",
      "date": "2 years ago"
    }
  ]
}