{
  "topProducts": [
    {
      "name": "Coffee",
      "description": "Good quality and reasonably priced, a standard fair.",
      "category": "drink",
      "reviewMentions": 28,
      "badge": "Top Pick",
      "quotes": [
        "Great food, coffee, and culture",
        "The staff are always calm and patient, the baked goods are always mind blowing and the coffee never disappoints",
        "They have some of the best chai tea chocolates or almond croissants I thoroughly enjoy their Vietnamese coffee"
      ]
    },
    {
      "name": "Chai Tea",
      "description": "Mentioned as a delicious drink option.",
      "category": "drink",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "My friend had Chai tea and and a ham and cheese croissant which she found to be delicious",
        "They have some of the best chai tea chocolates or almond croissants I thoroughly enjoy their Vietnamese coffee"
      ]
    },
    {
      "name": "Iced Coffee",
      "description": "A coffee drink served cold.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "All I wanted was a scone but they have a $5 credit card minimum so I got an iced coffee"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Gabriel Pass",
      "rating": 5,
      "text": "The MayDay Cafe is one of my favorite coffee shops ever.  A unique and eclectic vibe. The coffee and beverages are good but the food is really exceptional.  It's all made in-house, fresh, with quality ingredients, plus so many great options that are vegan, gluten-free, etc.\nWatch for their specials, but make sure to get them before they're gone! 😋",
      "date": "10 months ago",
      "source": "Google"
    },
    {
      "author": "Ali",
      "rating": 5,
      "text": "The May Day is a bright spot in the universe! The food is incredible, the coffee spot on, and the service is fast/friendly/knowledgable. Vegetarian options, vegan baked goods. The absolutely magical neighborhood and community vibe that shines from this place is unmatched! MmmmmmMay Day ❤️🌈💫 Bring your friendly face and community vibe and you’ll fit right in. InJoy!! 😘",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Ze'ev O'Rourke",
      "rating": 5,
      "text": "Smaller, good food and good coffee with GF and Vegan options on the menu (their GF scones were awesome!)",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Brian Huilman",
      "rating": 5,
      "text": "Strongly recommend! We just moved into South Minneapolis and walked to this place from our new home and I can already tell this is going to be one of our favorite spots! The breakfast burrito and sandwich were amazing and the sweet roll was exactly how my grandma used to make them: fluffy, sweet, and cinnamony! Wonderful staff had our food ready in no time.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Elizabeth Kerwin",
      "rating": 5,
      "text": "Quintessential Minneapolis local with excellent, above average quiche, bakery, and burritos. Phenomenal atmosphere - very diverse and welcoming. It encapsulates what I miss about living here! Definitely worth a trip - we went after bearing witness at George Floyd Plaza with our kids and before a long walk around the lake at Powderhorn. Great spot.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Kathryn Van Wert",
      "rating": 5,
      "text": "UPDATE: there are now croissants and the danishes are very good again!!! Yay!!!\n\nI’m really supportive of the workers’ coop and I want this place to succeed. In that spirit, I wish they’d step up their baked goods game. The baked goods used to be sooooo good and I’m sorry to say they’re not so good now. Specifically, they used to have the absolutely best croissants, and now they have none. Also, the fruit danish used to be really special; now, it’s made with pastry cream instead of cream cheese, and it’s not a good change. I’m not sure why these changes happened; maybe the old pastry chef left when they switched to a coop?",
      "date": "Edited 3 months ago",
      "source": "Google"
    },
    {
      "author": "Willow",
      "rating": 5,
      "text": "First time coming here with some friends, not a ton of seating, but it was easy enough to get a table for three of us. The quiche was great it was fluffy and super cheesey and it came with with a large side salad. The almond croissant was amazing, nice and flaky and nutty. The breakfast burrito was just okay. The coffee drinks were all super tasty. Overall, I liked this place and will be back for the quiche!",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Cory C.",
      "rating": 4,
      "text": "You guys bought a turn-key business with decades of experience and a collection of much loved recipes. Please put things back until you've mastered the old system under new ownership and then experiment with different ingredients and recipes on the side. I'm sure suppliers would be happy to give you samples to test out. Just my opinion but I think a popular one.  I've been coming here since 96' and will continue to despite the grumbling, but let's own up to the sub-par focaccia and make it right.",
      "date": "7 months ago",
      "source": "Google"
    },
    {
      "author": "R. B.",
      "rating": 5,
      "text": "By far, the best breakfast sandwich I've ever had is at May Day cafe. It's the veggie sausage breakfast sandwich- gooey cheese, eggs, and sausage so good you won't notice it's vegetarian! All on a panini style sandwich - even though I don't live in the neighborhood anymore I still return for it occasionally!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Shayon Keating",
      "rating": 5,
      "text": "Great coffee, amazing pastries, warm and comforting environment, friendly staff. 10/10 will be back and a mainstay whenever I’m in Minneapolis. This place deserves your business.\n\nAlso the cinnamon roll was HANDS down one of the best cinnamon rolls I’ve had in this country",
      "date": "a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:29:56.460Z"
}