{
  "topProducts": [],
  "highlightedReviews": [
    {
      "author": "Breanna Peltz",
      "rating": 5,
      "text": "This very well may be my favorite restaurant in Minneapolis! If you’re vegan/vegetarian or have dietary restrictions, this place is 1000% worth checking out. During our most recent visit, I had the Deadwood with tempeh (breakfast menu) and it was sooooo good. I’m literally salivating just thinking about it. (You guys.. where is your tempeh from? How do you make it so good??) Every server we’ve ever had has been kind and helpful, and it’s just such a chill, down-to-earth environment. My spouse and I make it out to MSP a couple of times a year and we have to stop every time! 🩷 Love you guys!!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Shannon Mahedy",
      "rating": 5,
      "text": "Modern Times is a classic Minneapolis cafe. I’m obsessed with their fresh food, huge portions, creative dishes, general vibe, and progressive politics. Everyone who works there is always friendly, and I love how anyone can find something they’ll like on the menu - vegan, vegetarian, gluten-free etc. It’s an inclusive and cool space with incredible food. Highly recommend.",
      "date": "Edited 6 months ago",
      "source": "Google"
    },
    {
      "author": "Naomi H",
      "rating": 5,
      "text": "What a gem of a place! I only wish that I had found this place sooner!  I had the Tempeh Reuben and it was the best and freshest Reuben that I have ever had! Every ingredient was so fresh and flavorful. A lot of the ingredients are made in house or sourced locally. The prices are very reasonable and the portions are generous.  Most items on the menu can be made Vegan, Vegetarian and are often available gluten free, as well. The staff made the whole experience even better... I can hardly wait to go again and try more items from their extensive menu. Thanks for putting your heart and soul into your food and service!",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Manuela Pichler",
      "rating": 5,
      "text": "Absolutely wonderful and magical place! The service was great and the food was delicious! We loved how easy it was to make the dishes vegan. We had the southside hash and breakfast burrito, both were super delicious! We also got some donuts to take home and they were amazing too! Loved the atmosphere too!! Can't wait to be back!",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Christian Noyce",
      "rating": 5,
      "text": "Been going to Modern Times for years now and have always had great service from amazing people. If you haven’t gone, I highly recommend. It is a staple of the cities that I bring those from near and far to. Great veggie and vegan options while balancing with the classic eggs and bacon for breakfast. Im a fan of the south side hash, my wife is a fan of the rancheros and my brother loves the good morning healing earth. A place for all to come together over some good food and coffee. No wonder the community is so strong when they got a place like this in it to come together.",
      "date": "a week ago",
      "source": "Google"
    },
    {
      "author": "Brandon Chmiko",
      "rating": 5,
      "text": "Modern Times has a down to earth vibe, great service and stellar food. I had their special - Yucca Sofrito with tofu. Fresh, rich in flavor and made quickly. They offer many vegan options and I felt right at home.",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Esther West",
      "rating": 5,
      "text": "Love Modern Times! I've been a couple times for brunch, and it's very tasty, with many great options. I much appreciate their political views. They have a ton of vegan options / variations. Understandably busy! : ) Cool vibe and unique spot.",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Emily Mills",
      "rating": 4,
      "text": "Punk cafes 4 ever! Love all the vegan options while still fulfilling my greasy spoon cravings. Friendly/attentive staff and great music played. Get there right when they open if you can, tho - place fills up quick!",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Lucy Bichakhchyan",
      "rating": 5,
      "text": "My favorite sloppy hangover food for vegans! Amazing service, great price and no I.C.E! Support this business.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Brock Nguyen",
      "rating": 5,
      "text": "Welcoming and cozy neighborhood breakfast spot. Menu is creative yet simple. There are options for vegan if that's your thing. Food was cooked perfect to order and arrived fast for how busy it was. The coffee was fantastic. Try the English Muffin option for toast.",
      "date": "3 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegetarian restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:22:44.424Z"
}