{
  "topProducts": [
    {
      "name": "Namaste mixed vegetables",
      "description": "A mixed vegetable dish that can be made vegan upon request.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I love their Namaste mixed vegetables with garlic butter paratha (both can be made vegan)"
      ]
    },
    {
      "name": "Garlic butter paratha",
      "description": "A flatbread with garlic and butter that can be made vegan upon request.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I love their Namaste mixed vegetables with garlic butter paratha (both can be made vegan)"
      ]
    },
    {
      "name": "Jackfruit Curry",
      "description": "A curry dish made with jackfruit.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Great food- love the jackfruit curry and paapri chaat"
      ]
    },
    {
      "name": "Cauliflower peas and potatoes",
      "description": "A dish made with cauliflower, peas, and potatoes.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "🤣 Highly recommend the creamy masala chicken, Golgappa, cauliflower peas and potatoes"
      ]
    },
    {
      "name": "Coconut Cream Chai",
      "description": "A yummy chai made with coconut cream.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The coconut cream chai was yummy and so was my creamy masala curry with chicken spice level 3 which next time I'll do a four or five haha 😂 My wife enjoyed her food as well"
      ]
    },
    {
      "name": "Spicy Masala Chai",
      "description": "A superb and excellent spicy masala chai.",
      "category": "drink",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "I ordered the creamy chicken masala curry and iced spicy masala chai",
        "The spicy masala chai is superb and the food is excellent"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Lucy Rosenmeier",
      "rating": 5,
      "text": "One of our favorite date night spots! Reliably amazing food, easy options for gluten free, vegan, and some complicated medical restrictions. Friendly staff and a nice, casual feeling inside and outside setting. The stairs make it physically less accessible.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Mitch Sivak",
      "rating": 5,
      "text": "Really great vegan options. I love their Namaste mixed vegetables with garlic butter paratha (both can be made vegan).\n\nThey respect food sensitivities. It's flavorful and a safe food of mine! (:",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Ella F",
      "rating": 5,
      "text": "This has been one of my favorite places for years. The staff have always been wonderful and kind. They go above and beyond service wise. Making sure we had plenty of rice and even some extra raita with my to go order on the way out. Just the most thoughtful touches. They actually make their food fresh so yes, it may take awhile but I don't mind waiting. During my travels in other countries you often wait an hour for them to cook your food. Waiting for amazing food is definitely never an issue for me. 🤣 Highly recommend the creamy masala chicken, Golgappa, cauliflower peas and potatoes. Really anything on the menu you cannot go wrong with. Definitely a must visit place. ❤️",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "Maggie Christopher",
      "rating": 5,
      "text": "My husband and I love this restaurant! They use high-quality, local meats and the flavors are amazing! I have some food sensitivities and they’re always very kind about working around that. And it’s easy to do with this type of food. Our servers have always been very polite and accommodating. This restaurant is a total gem in the Twin Cities!",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Kamal Rochlani",
      "rating": 5,
      "text": "Best and yummiest food! Loved the Chicken in mango curry 🍛 with Garlic paratha — absolutely delicious. The Spicy Masala tea was just perfect ☕️😋. Five stars to the chef, the ambience, and the amazing team. Please keep up the great work and continue running this beautiful cafe — places like this make the city feel warmer and happier!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Mary E. Roach",
      "rating": 5,
      "text": "Some of the most incredible food I've had in the Twin Cities, and an absolutely amazing variety of chai.\n\nSo far, I've tried 4 different chais they make, and I've been delighted each time.\n\nThe servers were also incredibly attentive, and refilled water, checked that everything was good, and brought things out quickly. This quickly became a fav of ours, and we'll definitely be returning.",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Claire Fienup",
      "rating": 5,
      "text": "Everything about my experience was wonderful! My mom and I came in for lunch because the chai was recommended by a friend. I had the Masala Chai and my mom had the Cardamom Ginger Chai and we were both pleased. We both had curry bowls which were delicious. I would highly recommend the Cauliflower and Pea curry. Almost all their curry options are gluten free and clearly marked on the menu. The lunch prices were very reasonable for the amount of food you get. Namaste is in an old house which is a beautiful atmosphere and feels like eating in a friends home. We were able to find parking 2 blocks away in the neighborhood without any problems. The service was excellent too. I will definitely be back to try more Chai! Please come out and support this business, especially with the construction on Hennepin.",
      "date": "10 months ago",
      "source": "Google"
    },
    {
      "author": "Josh Keane",
      "rating": 5,
      "text": "The food is delicious. Maybe I'm not well versed in Indian food, the dishes seem slightly expensive when you look at the menu, but the portions are quite large, I usually have enough leftovers for a second meal later!\n\nAll-in-all one of the tastiest and healthiest, if not the healthiest restaurant I've dined in the twin cities.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Whitney Krogstad-Yambrick",
      "rating": 5,
      "text": "Namaste Cafe is a great addition to the dining variety Minneapolis has to offer. It is located in a busy part of town and is easy to walk to. The outdoor patio spots this restaurant offers are unique and perfect! You can be outside and enjoy the fresh air, while still having some privacy to interact with your tablemates. The food is scrumptious and so are the cocktails!",
      "date": "a week ago",
      "source": "Google"
    },
    {
      "author": "David",
      "rating": 5,
      "text": "There’s a lot of great Indian food in Minneapolis, but this place sits firmly at the top of our list. Maybe it’s all in my head, but the quality here tastes noticeably better. Everything is fresh, light, and perfectly spiced. It’s one of those meals where, halfway through, you’re already planning when you can come back.",
      "date": "a month ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:24:13.326Z"
}