{
  "topProducts": [
    {
      "name": "Pho",
      "description": "Excellent, with various meats such as ribeye, chicken, oxtail, or three meat. Praised for its deep, intense, and flavorful broth, with some noting perfect portion sizes or issues with customization and accompaniments.",
      "category": "Entree",
      "badge": "Top Pick",
      "quotes": [
        "Excellent pho and spring rolls",
        "I got their pho with ribeye",
        "In particular, I very specifically asked for no green onions in my pho (I am extremely sensitive to the “raw” taste and texture, to the point of nausea) but it came with it anyways and removing it from the soup became too much of a hassle that I ended up not eating at all, and I was uncomfortable asking for a fix after seeing how he had handled my friend’s order"
      ],
      "reviewMentions": 20
    },
    {
      "name": "Cocktails",
      "description": "Superbly crafted, great, excellent, and top-notch drinks from a diverse cocktail menu.",
      "category": "Drink",
      "badge": "Top Pick",
      "quotes": [
        "Great Asian cuisine, beautiful cocktails and a superb ambiance",
        "Even the cocktails were to notch",
        "They also have a small selection of signature cocktails for you to try"
      ],
      "reviewMentions": 5
    },
    {
      "name": "Spring Rolls",
      "description": "Excellent, perfect, fresh, and extremely delicious, often noted for having a good dipping sauce.",
      "category": "Appetizer",
      "badge": "Top Pick",
      "quotes": [
        "Excellent pho and spring rolls",
        "The fresh spring rolls are perfect and the dipping sauce is so good",
        "The spring rolls and the pho were extremely delicious"
      ],
      "reviewMentions": 6
    },
    {
      "name": "Wontons",
      "description": "Described as amazing and the best ever.",
      "category": "Appetizer",
      "badge": "Featured",
      "quotes": [
        "We also ordered an order of the wontons, amazing, best I've ever had"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Pork Belly",
      "description": "Amazing, very soft and flavorful.",
      "category": "Entree",
      "badge": "Top Pick",
      "quotes": [
        "Pork belly is amazing",
        "Dishes ranged from excellent (pork belly small plate, bun, one of the few vegetarian dishes in offer) to disappointing (ramen made with soba noodles and two tablespoons of red pepper flakes, a second dish unexpectedly served with cold ingredients)",
        "The pork belly appetizer (enough for two) and pineapple thit kho (pictured and pairs very well with the panjas côtes de Gascogne) were amazing"
      ],
      "reviewMentions": 4
    },
    {
      "name": "Wings",
      "description": "Described as incredible.",
      "category": "Appetizer",
      "badge": "Featured",
      "quotes": [
        "I also had the wings which were incredible as well"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Bahn Mi with Shrimp",
      "description": "Features perfectly cooked, lightly deep-fried, and non-greasy shrimp.",
      "category": "Entree",
      "badge": "Featured",
      "quotes": [
        "Michael had Bahn Mi with shrimp"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Tofu Bun",
      "description": "Described as delicious, and recommended for those curious about trying tofu.",
      "category": "Entree",
      "badge": "Featured",
      "quotes": [
        "If you haven’t tried tofu but are curious about it, I recommend the tofu bun-so delicious"
      ],
      "reviewMentions": 1
    }
  ],
  "highlightedReviews": [
    {
      "author": "Tico Hernandez",
      "rating": 5,
      "text": "While visiting St. Paul to see the Minnesota Wild play and go to see Muse in concert, I happened upon Ngon Bistro.\nFrom the moment I arrived the staff was absolutely friendly and incredible. After getting some local brew suggestions, I ordered the Chicken Pho. As a huge Pho fan, I have to say this probably is the best broth I have ever had! The chicken was absolutely incredible and portion size was right on point. I also had the wings which were incredible as well. With both things I highly recommend their house made hot sauce which was amazing!\nOverall it’s one of the best dining experiences I have ever had. Ask for Junior, Zach, or Lisa as they were very friendly and very great at their job! Incredible service and incredible food with a low key vibe. Highly recommend this place!!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Daniel Arend",
      "rating": 5,
      "text": "I’m currently unloading my second helping from a takeout container - I can’t believe I’ve never been here before. Everything was incredible and traveled surprisingly well. The pork belly was crispy and meaty, and the chicken bun and bo kho were so fresh yet savory at the same time. We paired it with a white natural wine from The Wine Shoppe in St Anthony Park and it was a fantastic meal. This will be a staple.",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Jake Neurer",
      "rating": 5,
      "text": "4.5 ⭐ Had an awesome date on the patio. The whole service outside is operated on the Toast application, you scan a code at your table, order, and pay all within the app.\n\nI ordered an old fashioned & started with their crispy rabbit dumpling. The dumpling came out freshly hot on flavorful coconut curry. The old fashioneds were aromatic but lacked both boozy or a sweet punch.\n\nNext was an order of steamed duck bao, which tasted delicious but was a little dry. Admittedly, we went towards the end of their operating hours and I understand duck is hard to keep moist over the course of the day. We ended up dipping them in the coconut curry and really enjoyed them.\n\nBest of all, we had the pleasure of having the chef's special pastrami sandwich! Bo kho spiced pastrami, 24 hour slow smoked and pho broth steamed meat. Stacked on top of caraway rye bread with a good touch of whiskey whole grain mustard. EASILY one of the best sandwiches in St. Paul!\n\nThe cocktail could be easily touched up and the bao buns could use a dipping sauce. Otherwise, everything was excellent, especially that pastrami sandwich!",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Ron Zack",
      "rating": 5,
      "text": "Driving down University Ave one Saturday afternoon, looking for a place to eat dinner, I passed by Ngon Bistro, and thought I'd give them a try, so glad I did!\n\nThe food here is Vietnamese/Asian fusion, and includes favorites like pho, spring rolls and bahn mi.  In the summer months there is a wonderful little outdoor patio for dining, but I decided to stay indoors.  The dining room is bright and cheery, thanks to light colors and huge picture windows at the front of the store.   It's fun to sit and watch the streetcars go by on the Metro's Green Line!  You can use the Victoria St. station stop to get here.\n\nThe menu is a simple one page affair, with a small but excellent selection of Vietnamese/Asian inspired food.  I was also given a page of daily specials.  Lots's of great food to choose from!   They also have a small selection of signature cocktails for you to try.  I had the Lemon Basil Negroni, and it was excellent!\n\nFor a \"small plate\" appetizer, I decided on pork egg rolls, and they were wonderful.  They came with a nice, sweet dipping sauce.  I had no problem eating them both!\n\nMy main course was the pho with meatballs.  Oh my goodness!  It was the best soup I've ever had in my life!   And so very filling.\n\nThe staff here are really great people, and wonderful to deal with.  The decor is simple, bright and cheery.  Parking can be an issue, but I had no problems finding a spot close by.  The food itself is OUTSTANDING.   Bar service is top notch.\n\nIf you stick to just a main course and water, you can dine for about $20 a person.   Add adult drinks and appetizers, and your looking at $50 a person.\n\nI give Ngon Bistro my HIGHEST RECOMMENDATION!  I do plan on coming back again.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Vanessa Martin",
      "rating": 4,
      "text": "The food was hit and miss. My pastrami sandwich was amazing although I’m not sure why the scallions were sprinkled all over the plate instead of in my sandwich. My husband’s food wasn’t hot. The service is the reason for only 4 stars. They refilled our water once while we had appetizers and then not again until after we were done with our entrees despite our glasses being empty. If anyone had come to check on us they would have sold another cocktail and glass of wine. We sat with no plates waiting for the bill for way too long.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Mike Brandes",
      "rating": 5,
      "text": "My girlfriend and I, on a lark, decided to head to Ngon Bistro.\n\nThis place is very large, many tables inside and outside, so getting a seat was a breeze - they noted they do not do reservations with fewer than five people.\n\nWe had a few starters (pork & ramp sandwich, duck bao and the rabbit dumplings) they were all excellent. For our main courses we shared Pho (ribeye, very good!) and the Bun. They were both excellent.\n\nWe had a total of three drinks, the gin and tonic was delightful, the spritz was great - they used an amaro that wasn’t aperol, it seemed, which was nice and the Manhattan; all well made.\n\nThe staff was very friendly, they have one of those “view the menu and order on your phone” systems that is becoming more popular. It worked out alright for us, no complaints there. There were also several humans to chat with for “when the robot can’t answer your questions,” as one server put it.\n\nWould definitely come back here again, sit on the patio to enjoy the sunshine and bring some friends so we can eat more food family style.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Alyssa Schulke",
      "rating": 5,
      "text": "Cute patio but we usually sit at the bar for great drinks and conversation. Mainstay of Saint Paul - specials are usually a home run. Jazz on Saturdays and a great spot for MNUFC events at Allianz. Go Loons!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Darcie Vandegrift",
      "rating": 4,
      "text": "Beautiful interior and unique menu. Dishes ranged from excellent (pork belly small plate, bun, one of the few vegetarian dishes in offer) to disappointing (ramen made with soba noodles and two tablespoons of red pepper flakes, a second dish unexpectedly served with cold ingredients). Nice wine list for price point. Extensive cocktail list. Good service for covid times (understaffed but solid people). I appreciated them not assuming that the men at the table were hosting. Waiter said they had kitchen staffing and food supply problems. I will go back. I think it was a bumpy night rather typical.",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Kara Sweeney",
      "rating": 5,
      "text": "This place is phenomenal. The food is fresh, clean and well thought through. I don't think they're currently open for dine in, but when they are you can also expect a shockingly impressive cocktail list (speaking as a former craft bartender) and an outstanding wine list. Tap beers galore as well -- though I'm not personally a beer person and you shouldn't believe my judgements on beer regardless 😜",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Naomi Hagen Laufers",
      "rating": 5,
      "text": "We were literally the last customers they had as they closed the restaurant for good. It was my husband and my first and last time.  We talked to the owners and had amazing service. 👏 We wish you were staying open but as small business owners, we understand the commitment and knowing when it's time to find a new adventure! The food was amazing and we wish you the best in what is next!",
      "date": "2 years ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "REAL - From Apify-scraped Google reviews",
  "lastUpdated": "2026-02-06T00:12:29.797Z"
}