{
  "topProducts": [
    {
      "name": "Fresh Spring Rolls",
      "description": "Described as 'perfect' and 'extremely delicious', served with a 'so good' dipping sauce.",
      "category": "appetizer",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "The fresh spring rolls are perfect and the dipping sauce is so good",
        "The fresh spring rolls are great and run out quickly, so be sure to snag some"
      ]
    },
    {
      "name": "Tofu Bun",
      "description": "A delicious dish recommended for those curious about tofu.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "If you haven’t tried tofu but are curious about it, I recommend the tofu bun-so delicious"
      ]
    },
    {
      "name": "Hot Tea",
      "description": "A delightful, deep red tea.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I also ordered a hot tea that was deep red and it was delightful"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Tico Hernandez",
      "rating": 5,
      "text": "While visiting St. Paul to see the Minnesota Wild play and go to see Muse in concert, I happened upon Ngon Bistro.\nFrom the moment I arrived the staff was absolutely friendly and incredible. After getting some local brew suggestions, I ordered the Chicken Pho. As a huge Pho fan, I have to say this probably is the best broth I have ever had! The chicken was absolutely incredible and portion size was right on point. I also had the wings which were incredible as well. With both things I highly recommend their house made hot sauce which was amazing!\nOverall it’s one of the best dining experiences I have ever had. Ask for Junior, Zach, or Lisa as they were very friendly and very great at their job! Incredible service and incredible food with a low key vibe. Highly recommend this place!!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Jill L",
      "rating": 5,
      "text": "My bf took me here after he had been here a few years before & loved it. He loves pho, I had never had it. We both ordered a different pho & it was really good. I had the 3 meat pho & he had ribeye pho. We also ordered an order of the wontons, amazing, best I've ever had! We ordered a 2nd order & brought them home! I also ordered a cherry coke & came with boozy cherries, excellent! The restaurant has a cozy feeling, yellow walls & pictures of art on the walls. They have a bar with probably 10 chairs, 3 hightop tables, 3 tables & a few booth/tables. We were asked if we had reservations, and we did not know that we had to have them. The man sat us in the bar area at a hightop table which were reserved for walk ins along with anything at the bar. Our waiter took our drink orders & another took appetizer order. Another guy brought our appetizer out & a different man gave us our main entrées.  We had about 4 different waiters, which was confusing. We asked 1 of them for our check & another man finally gave it to us. Its pretty loud in this place, they had easy-going music playing overhead. Good place to get some pho!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Naomi Hagen Laufers",
      "rating": 5,
      "text": "We were literally the last customers they had as they closed the restaurant for good. It was my husband and my first and last time.  We talked to the owners and had amazing service. 👏 We wish you were staying open but as small business owners, we understand the commitment and knowing when it's time to find a new adventure! The food was amazing and we wish you the best in what is next!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Barbara Rose",
      "rating": 5,
      "text": "Michael and I came in on a Sunday evening around 7:00 p.m. the place was packed. It was on Lee Junior and Zachary running the front , but doing so efficiently and quickly. They said please come in. It will be approximately a half an hour but have a seat at our bar and feel free to get a drink while you wait. Very accommodating. The food was amazing. Of course! I got their pho with ribeye. There was plenty of meat! And the flavor was so deep and intense. Just delicious! Michael had Bahn Mi with shrimp. Can't remember what it was called lol but the shrimp was cooked so perfectly! A light deep fry on it. Not greasy! I highly recommend but so does everybody else! They have won tons of rewards!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Jake Neurer",
      "rating": 5,
      "text": "4.5 ⭐ Had an awesome date on the patio. The whole service outside is operated on the Toast application, you scan a code at your table, order, and pay all within the app.\n\nI ordered an old fashioned & started with their crispy rabbit dumpling. The dumpling came out freshly hot on flavorful coconut curry. The old fashioneds were aromatic but lacked both boozy or a sweet punch.\n\nNext was an order of steamed duck bao, which tasted delicious but was a little dry. Admittedly, we went towards the end of their operating hours and I understand duck is hard to keep moist over the course of the day. We ended up dipping them in the coconut curry and really enjoyed them.\n\nBest of all, we had the pleasure of having the chef's special pastrami sandwich! Bo kho spiced pastrami, 24 hour slow smoked and pho broth steamed meat. Stacked on top of caraway rye bread with a good touch of whiskey whole grain mustard. EASILY one of the best sandwiches in St. Paul!\n\nThe cocktail could be easily touched up and the bao buns could use a dipping sauce. Otherwise, everything was excellent, especially that pastrami sandwich!",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Ron Zack",
      "rating": 5,
      "text": "Driving down University Ave one Saturday afternoon, looking for a place to eat dinner, I passed by Ngon Bistro, and thought I'd give them a try, so glad I did!\n\nThe food here is Vietnamese/Asian fusion, and includes favorites like pho, spring rolls and bahn mi.  In the summer months there is a wonderful little outdoor patio for dining, but I decided to stay indoors.  The dining room is bright and cheery, thanks to light colors and huge picture windows at the front of the store.   It's fun to sit and watch the streetcars go by on the Metro's Green Line!  You can use the Victoria St. station stop to get here.\n\nThe menu is a simple one page affair, with a small but excellent selection of Vietnamese/Asian inspired food.  I was also given a page of daily specials.  Lots's of great food to choose from!   They also have a small selection of signature cocktails for you to try.  I had the Lemon Basil Negroni, and it was excellent!\n\nFor a \"small plate\" appetizer, I decided on pork egg rolls, and they were wonderful.  They came with a nice, sweet dipping sauce.  I had no problem eating them both!\n\nMy main course was the pho with meatballs.  Oh my goodness!  It was the best soup I've ever had in my life!   And so very filling.\n\nThe staff here are really great people, and wonderful to deal with.  The decor is simple, bright and cheery.  Parking can be an issue, but I had no problems finding a spot close by.  The food itself is OUTSTANDING.   Bar service is top notch.\n\nIf you stick to just a main course and water, you can dine for about $20 a person.   Add adult drinks and appetizers, and your looking at $50 a person.\n\nI give Ngon Bistro my HIGHEST RECOMMENDATION!  I do plan on coming back again.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Alyssa Schulke",
      "rating": 5,
      "text": "Cute patio but we usually sit at the bar for great drinks and conversation. Mainstay of Saint Paul - specials are usually a home run. Jazz on Saturdays and a great spot for MNUFC events at Allianz. Go Loons!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Vanessa Martin",
      "rating": 4,
      "text": "The food was hit and miss. My pastrami sandwich was amazing although I’m not sure why the scallions were sprinkled all over the plate instead of in my sandwich. My husband’s food wasn’t hot. The service is the reason for only 4 stars. They refilled our water once while we had appetizers and then not again until after we were done with our entrees despite our glasses being empty. If anyone had come to check on us they would have sold another cocktail and glass of wine. We sat with no plates waiting for the bill for way too long.",
      "date": "3 years ago",
      "source": "Google"
    },
    {
      "author": "Daniel Arend",
      "rating": 5,
      "text": "I’m currently unloading my second helping from a takeout container - I can’t believe I’ve never been here before. Everything was incredible and traveled surprisingly well. The pork belly was crispy and meaty, and the chicken bun and bo kho were so fresh yet savory at the same time. We paired it with a white natural wine from The Wine Shoppe in St Anthony Park and it was a fantastic meal. This will be a staple.",
      "date": "4 years ago",
      "source": "Google"
    },
    {
      "author": "Kathy Lantry",
      "rating": 5,
      "text": "I love the food here.  The fresh spring rolls are perfect and the dipping sauce is so good.  If you haven’t tried tofu but are curious about it, I recommend the tofu bun-so delicious.",
      "date": "2 years ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:30:56.781Z"
}