{
  "topProducts": [
    {
      "name": "Roti Canai",
      "description": "A type of flatbread, mentioned as a favorite. The curry sauce it comes with is described as 'sooo good'.",
      "category": "appetizer",
      "reviewMentions": 9,
      "badge": "Top Pick",
      "quotes": [
        "I also tried the Roti Canai (presented slightly different than stands in Malaysia) and the flavor brought me right back to Kuala Lumpar… ❤️",
        "Roti canai and chicken satay are old favorites from when we used to dine in store",
        "Their roti canai and rendang are absolutely authentic"
      ]
    },
    {
      "name": "Golden Tofu",
      "description": "A tofu dish listed as a 'go-to' item.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Our go-tos are lamb (kambing) rendang and golden tofu, but the nasi lemak and roti canai are also on-point (the roti canai curry sauce is sooo good)"
      ]
    },
    {
      "name": "Vegetable Fried Rice (no eggs)",
      "description": "A vegetable fried rice ordered without eggs, described as having 'so much flavor' and being 'piping hot'.",
      "category": "entree",
      "reviewMentions": 0,
      "badge": null,
      "quotes": []
    },
    {
      "name": "Chili Tofu",
      "description": "A tofu dish, although a review noted it wasn't spicy even when requested.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The chili tofu wasn't spicy at all even if I asked for spicy in my original order"
      ]
    },
    {
      "name": "Pilut Hitam",
      "description": "A black glutinous rice dessert.",
      "category": "dessert",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I had Char Kwai teoy, chicken satay, roti cana, and pilut hitam, and it was really good"
      ]
    },
    {
      "name": "Mango Sticky Rice",
      "description": "A dessert described as 'absolutely spectacular'.",
      "category": "dessert",
      "reviewMentions": 4,
      "badge": "Top Pick",
      "quotes": [
        "The desserts are also absolutely spectacular - especially the mango sticky rice",
        "I can only speak on the mango sticky rice as that’s all we ordered for delivery",
        "the tofu was heavenly and the mango sticky rice was soooo good"
      ]
    },
    {
      "name": "Bubble Tea",
      "description": "A popular drink at the establishment, mentioned multiple times.",
      "category": "drink",
      "reviewMentions": 3,
      "badge": "Popular",
      "quotes": [
        "My favorites are their skewers, roti, and bubble tea",
        "It’s a pretty solid restaurant, but I have to say I was absolutely shook when I got the orange mango bubble tea and it came with whole chunks of orange with the rind still on and pieces of tomato",
        "I ordered that and a matcha bubble tea"
      ]
    },
    {
      "name": "Specialty Drink with Mango Popping Boba",
      "description": "A life-changing specialty drink containing mango popping boba, strawberry, and pineapple from fresh or frozen fruit.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "It’s a specialty drink with mango popping Boba and it was life-changing"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Marilyn Preston",
      "rating": 5,
      "text": "I have been a big fan of Peninsula for years. I like the roti, and i like the pineapple rice, but my hands down absolute favorite comfort meal in the twin cities is Peninsula's Spicy and Salted Tofu. Holy buckets is this a delicious dish. The tofu is homemade and tender, the flavoring is superb. Every time I am sick, or I am sad, or I am just hungry, I want this meal. I hate leaving reviews, but I have loved this dish for over a decade and figured I owed at least one review to the restaurant.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Jay Shen",
      "rating": 4,
      "text": "As one of the few, if not the only place, that has nasi lemak, this establishment does a great job in providing dishes that range from Chinese to Malaysian to Singaporean cultures. I believe that since COVID they have transitioned to takeout only, and it's great to see that the business is still thriving even if they are still operating under the takeout only model despite how the world has evolved away from the pandemic.\n\nFor the few dishes that I came here for, qualities varied, with some dishes lacking flavor while others simply sloppily created. The Hainanese chicken relied solely on the extra dipping sauces for flavor while the chicken itself had no flavor alone. The nasi lemak had good flavor mainly because of the sambal, and the chicken had good texture. I didn't see any peanuts in the dish, which I thought was needed for nasi lemak. The sizzling beef and ginger scallion duck had pretty expected flavor because of their ingredients, meaning that what they looked like was what they tasted like, if that makes sense.\n\nWhen I got food from there a second time 4 months later, overall the food was better. The chili tofu wasn't spicy at all even if I asked for spicy in my original order. The char kway teow had both good flavor and soft texture, allowing a positive tasting experience. The sambal shrimp had a good amount of vegetables and not enough shrimp, and had very good flavor because of the sambal infused with the dish.\n\nBecause their menu is huge, I think they have an adequate selection of options that can serve customers of all kinds. Even though this is not one of my favorite spots within the Twin Cities, the dishes they have already solidifies this establishment as a \"must not miss\" within the area.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Andrew Koly",
      "rating": 5,
      "text": "My name is Andrew Koly. I had my right arm amputated some years ago and I’m currently traveling from Denver Colorado to Minneapolis.\nMinniapolis seems like they found Boba and this city went all in and there is a lot of Boba in the city but, this particular store and this particular Boba is the top of the top. The cream of the cream as good as it gets. As a disabled man, I order DoorDash a lot, and I was blown away the first time I tasted their Drink drinks. It’s a specialty drink with mango popping Boba and it was life-changing. It also had strawberry and pineapple in it and I could tell if these were frozen fruit that they cut up and put in the drink. It was amazing.\n\nIf you get a chance to go there, my server’s name was Sunny. I told her about my experiences that was having drinking her Boba and she insisted on me to try other things. Her Deep understanding of the menu, her passion for creating works of art and calling them drinks and her empathy and the question she asked me to find out what I liked brought me to tasting flavors. I could not imagine. I’m so grateful when a company hires. Good customer service when they get a good person who really cares.\n\nPlease, if you are management with this company, you need to promote Sunny as soon as possible. She needs to be training everybody on how to talk to the customers. She really needs her own store because this lady made me feel so good. I’m ready to move to Minneapolis over my experience at a boba drink place!!!!!\n\nI can’t stress this enough, you took an out of place disabled man, five days before his birthday. He was having a really bad time because recent loss he’s experienced and you made him forget that he Is missing his right arm and his family members. He brought him a place of love and happiness and peace and it’s all thanks to your drinks and a lady named Sonny answering the phone and directing me to peace and happiness.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Morgan Erickson-Davis",
      "rating": 5,
      "text": "Love the food here. Our go-tos are lamb (kambing) rendang and golden tofu, but the nasi lemak and roti canai are also on-point (the roti canai curry sauce is sooo good). Wasn't a huge fan of the popiah, but maybe it's just not my thing.\nNot much heat, though; we chose the \"hot\" spice level and it was barely discernible. Nbd since the flavors more than make up for it.\nAlso fyi they weren't open for dine-in when we tried to get a table on 9/24/22. Take out only. I hope they reopen the dining room soon!",
      "date": "Edited a year ago",
      "source": "Google"
    },
    {
      "author": "Nam Anh Nguyen",
      "rating": 5,
      "text": "One of my favorite restaurants in the Twin Cities, I get food from here almost every week. Huge menu of food to try out but my go to is Mee Siam. Their desserts and drinks are incredible too – I always get drinks or desserts with my food. It's been a while since they only takeout only but the it's a very short wait and the food is always packed so well. Highly recommend spot!",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Michael Pohlad",
      "rating": 5,
      "text": "I have ordered Peninsula through Uber Eats a couple of times and I have always enjoyed their food; however I did not feel compelled to write a review (which I rarely do) until I received the wrong order in the Uber Eats bag. I called Peninsula and spoke to a professional and polite woman named Sana (I apologize if I have misspelled her name) who offered to make things right without me having to deal with Uber Eats. Not only was I able to get my food free of charge and hassle, but Peninsula gave us two beautiful cakes and mango sticky rice (both of which I highly recommend). In addition to the food being the best Malaysian Cuisine in the Twin Cities, the service you can expect is equally as impressive.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Sandra George",
      "rating": 5,
      "text": "I wish I had known about this place when dine in was an option. I lived in Malaysia for a few years and have tried several restaurants in different states that say they are Malay. However, it wasn’t the same. I had resolved to just find “American” Malay when someone told me of this place. To my surprise my favorite Malay food was available and amazing. Chicken Satay (Malay) is different than other satay and this place nailed it!  I also tried the Roti Canai (presented slightly different than stands in Malaysia) and the flavor brought me right back to Kuala Lumpar… ❤️. I will be ordering from them again!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Jacqueline Mussack",
      "rating": 5,
      "text": "I got this food delivered on door dash. It's soooooo good! I recommend the yam pot! I wish I could order hundreds of the taro nest bowls and eat them plain. The Pulut Hitam (wild rice dessert with coconut milk) is my new favorite dessert. The drinks are out of this world, especially the ones with jasmine, and the chestnut and taro smoothies. They have black sesame cheese foam, which tastes like really good black sesame flavored whipped cream. It is not cheesy, it is sweet and delicious. There's a huge variety of delicious, flavorful, aromatic entrees and appetizers as well.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Danae Hudson",
      "rating": 5,
      "text": "I was really craving Hainenese chicken. I ordered that and a matcha bubble tea. Lately, I’ve been trying to get almost no sugar in my bubble teas because they’ve been so sweet. This one was perfect. The Hainenese chicken was delicious and had large portions. I’m hoping to order from here again in the near future.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Shveta Setia",
      "rating": 5,
      "text": "I have been to this place twice and have had great experience. The food is AWESOME. Roti kanai is a must before starting anything else. I absolutely LOVED their beef brisket hot pot. Service was not McDonald's fast, but decent. We didn't wait for our food for more than 15-20 minutes, which should be expected if you are going to a place that serves freshly made food. I highly recommend this place.",
      "date": "Edited 2 years ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:30:32.764Z"
}