{
  "topProducts": [
    {
      "name": "Truffle Fries",
      "description": "A favorite side dish, described as excellent. Comes with a house made ketchup.",
      "category": "appetizer",
      "reviewMentions": 5,
      "badge": "Top Pick",
      "quotes": [
        "I settled on a Pornstar martini, a blues burger and a side of truffle fries",
        "the double barrel burger with truffle fries were full of flavor",
        "Truffle fries were good with a generous amount of parmesan the cheese dusted on them"
      ]
    },
    {
      "name": "Home made chips",
      "description": "Described as excellent.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Home made chips were excellent"
      ]
    },
    {
      "name": "Beet Salad",
      "description": "A salad that is highly recommended and never misses.",
      "category": "appetizer",
      "reviewMentions": 2,
      "badge": "Popular",
      "quotes": [
        "The beet salad never misses",
        "The beet salad and the 60/40 burger were great"
      ]
    },
    {
      "name": "Blood Orange Mocktail",
      "description": "A very delicious non-alcoholic drink with blood orange.",
      "category": "drink",
      "reviewMentions": 0,
      "badge": null,
      "quotes": []
    },
    {
      "name": "Pornstar Martini",
      "description": "A sweeter martini that comes with a small sparkling wine chaser.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I settled on a Pornstar martini, a blues burger and a side of truffle fries"
      ]
    },
    {
      "name": "Old Fashioned",
      "description": "A classic cocktail described as top notch.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I had Ahi crisps, 60/40 burger, and an old fashioned"
      ]
    },
    {
      "name": "Beer",
      "description": "A beer was ordered with a meal.",
      "category": "drink",
      "reviewMentions": 4,
      "badge": "Top Pick",
      "quotes": [
        "Got the ahi crisps, the double barrel burger, and one beer",
        "Beers were great, they only carry local beers so keep that in mind",
        "Their beer selection is unique and well crafted"
      ]
    },
    {
      "name": "Red Wine",
      "description": "Red wine was served with a meal.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "My red wine was also served ice cold, unfortunately"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Mary Ann Gazich",
      "rating": 5,
      "text": "Absolutely love Red Cow North Loop! The vibe is always on point, and the onsite team makes every visit feel like catching up with good friends amidst fabulous eats and an A+ atmosphere 🎉\n\nHuge shoutout to Kari, who always goes above and beyond — seriously the definition of excellent service. She remembers the little things and somehow manages to make every guest feel like a regular. She is a rockstar!\n\nCullen deserves a ton of credit too…. he takes the time to check in, even remembering my niece by name and asking thoughtful question. That kind of genuine care and kindness is rare and so appreciated.\n\nAnd of course, Sam — absolute icon, total GOAT status. Brings the energy, the humor, and makes every visit better just by being there.\n\nRef Cow North Loop has built something special — amazing food, even better people. Can’t recommend it enough!",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Jan Tillotson",
      "rating": 5,
      "text": "This restaurant was a new find for us and now it’s our favorite in Minneapolis. The food is amazing and unique, but what makes this place so unusual is the staff. I don’t know when I’ve experienced a restaurant staff so welcoming, informative, helpful, warm and on top of things.  We had the most amazing server I’ve ever had. Her name is Amajae — the joy and professionalism she brings to her job is infectious.  We were happy to be together as a family but her energy and presence took our experience to another level. She just made our evening. I’m not sure Ive ever had an experience like this in my 82 year.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Dexter Smith",
      "rating": 5,
      "text": "Great food and great service.  Came across this place while visiting Minneapolis and had dinner here.  Tried thier Blue Burger and other person had thier Shroon Burger.  Both were delicious,  juicy,  fresh with lots of flavor.  We throughly enjoyed our meal.   Had cocktails too.  The What's up Doc was delicious and very well made.  I'd definitely recommend giving this place a try I am sure you'll love it!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "I “The Swedish Chef” I",
      "rating": 5,
      "text": "Here's a rewritten version:\nRed Cow has several locations, and this one stands out as my favorite. The interior has a fresh, contemporary design that feels current and inviting. Both the attentive service and delicious food exceeded expectations. It's an excellent choice for anyone looking for quality burgers. Even the salad I had was amazing.",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "sterling sibley",
      "rating": 5,
      "text": "I went Red Cow to have a burger I had the ultimate it was fabulous however I only gave 4 stars for the food because at the end of my burger I ordered some Buffalo wings and they were awful, Buffalo you think tangy alittle spicy but the wings were to sweet , why would anyone put sugar in the wing sauce is beyond me other that that the service was awesome I would recommend this place.",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Nate Keator",
      "rating": 5,
      "text": "I visited from out of state and came to Red Cow North Loop with some friends. The staff, food and drinks were amazing. I had Ahi crisps, 60/40 burger, and an old fashioned. All were top notch. I very much wish I had a Red Cow down the block in Steven’s Point. It’d be the best eatery in town overnight.",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "Corinne Welter",
      "rating": 4,
      "text": "Brittni was cheerful, helpful and eager to point out her favorite aspect of the new renovation. The space was lovely and happy hour has a robust menu. My martini was ordered dirty but lacked olive juice which is the only reason I haven’t given 5 stars. The bar, however, was very busy so I assume that was just an accident. Great food, great service and the wine is good!",
      "date": "3 months ago",
      "source": "Google"
    },
    {
      "author": "Michael Santangelo",
      "rating": 5,
      "text": "What a special place Red Cow is! We were stopping in town for a wedding and visited Red Cow an hour before they closed. The service was spot on, super friendly and very helpful in picking out menu items. The food was incredible! Loved the special ketchup and the aioli with the fries. The burgers were excellent and overall the value was in line with the quality of food. Highly recommended!",
      "date": "5 months ago",
      "source": "Google"
    },
    {
      "author": "Charles Davis",
      "rating": 5,
      "text": "This place was fantastic. I got the 60/40 burger, which is 60% beef and 40% bacon, with candied bacon and cheese. It was very rich and flavorful. My favorite part was the candied bacon. It was very sweet, thick, and tender. I also got the milk shake of the day which was a dole whip milkshake. I also tried the birthday cake milkshake; both were great. I also got the sweet potato fries which were also amazing. I ordered all this to go, but I will say that the inside looked very nice, cozy, and upscale. Highly recommend trying this place.",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Katherine Lohman",
      "rating": 5,
      "text": "Red Cow was one of the best dining experiences we've had in a very long time. A huge shoutout to our amazing server Tyler who was very knowledgable about the gluten free options (which are plentiful!) and was incredibly kind, fun, and attentive to our needs. The manager came over to our table at one point and was very personable and engaged -- you can tell he values his staff and educates them well. The beet salad and the 60/40 burger were great! I wish we lived locally so that we could give this restaurant more of our business. If you're debating where to eat, go here!",
      "date": "6 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:33:33.323Z"
}