{
  "topProducts": [
    {
      "name": "Monster Mash",
      "description": "Hot apple cider and miso caramel topped with coconut whip.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Had the monster mash and its landing in my top 10 drinks of my life"
      ]
    },
    {
      "name": "Vegan breakfast burrito",
      "description": "An incredible vegan breakfast burrito.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Got a vegan breakfast burrito which was INCREDIBLE and also loved the vegan sausage biscuit"
      ]
    },
    {
      "name": "Vegan sausage biscuit",
      "description": "A vegan sausage biscuit, mentioned as a great breakfast option.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Got a vegan breakfast burrito which was INCREDIBLE and also loved the vegan sausage biscuit"
      ]
    },
    {
      "name": "Lemonade",
      "description": "A refreshing drink.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Biked over from the river and was lovely to sip on refreshing drinks- got the lemonade and Jamaica, both so delicious"
      ]
    },
    {
      "name": "Jamaica",
      "description": "A delicious and refreshing hibiscus tea drink.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "Biked over from the river and was lovely to sip on refreshing drinks- got the lemonade and Jamaica, both so delicious"
      ]
    },
    {
      "name": "Vegan breakfast sausage and biscuits and gravy",
      "description": "Vegan version of the classic breakfast dish.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "I have especially enjoyed their vegan breakfast sausage and biscuits and gravy"
      ]
    },
    {
      "name": "Tofu scramble",
      "description": "Flavorful and satisfying scramble with smoky tempeh.",
      "category": "entree",
      "reviewMentions": 3,
      "badge": "Popular",
      "quotes": [
        "I didn’t love the hash browns, too oily for me, but the tofu scramble was good",
        "I had the tofu scramble, and the smoky tempeh in it was hands-down my favorite part—so flavorful and satisfying",
        "Otherwise, loved the tofu scramble and the vegan sausage patty was good"
      ]
    },
    {
      "name": "Fluffy pancake",
      "description": "A standout fluffy pancake, especially with maple syrup.",
      "category": "entree",
      "reviewMentions": 4,
      "badge": "Top Pick",
      "quotes": [
        "I get the fluffy pancakes every time I go",
        "The fluffy pancake was also a standout, especially drizzled with maple syrup",
        "People sleeping in booths, chaotic vibe…\n\nI ordered biscuit breakfast, rancheros and a fluffy pancake"
      ]
    },
    {
      "name": "Coffee",
      "description": "Decent, very good coffee.",
      "category": "drink",
      "reviewMentions": 18,
      "badge": "Top Pick",
      "quotes": [
        "Never had their food it's one star because the coffee was extremely acidic and frankly gross :( but I love everything else about this place and have been here for many events",
        "The person who took our order was borderline dismissive of allergen concerns and was very preoccupied talking with a friend at the counter, to the point their friend was the one who refilled our coffees despite them not being an employee at the cafe",
        "Me, my husband and our friend went and enjoy the breakfast and coffee as we had years before"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Marques Garrett",
      "rating": 5,
      "text": "Seward Cafe is a gem for anyone looking for amazing vegan options! I had the tofu scramble, and the smoky tempeh in it was hands-down my favorite part—so flavorful and satisfying. The fluffy pancake was also a standout, especially drizzled with maple syrup. Cozy atmosphere, great food, and friendly service. Definitely worth a visit!",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Ivy Bolthouse",
      "rating": 5,
      "text": "Love Seward cafe overall. Good prices, good ethics. I have especially enjoyed their vegan breakfast sausage and biscuits and gravy. I didn’t love the hash browns, too oily for me, but the tofu scramble was good. As far as drinks go, I have had mixed experiences. The chai was good one time but the next time it had an overpowering taste of cloves and I struggled to drink it (and I do like spicy chai) so I hesitate to order that again.\n\nThey have 2 single-user bathrooms which are both gender neutral.",
      "date": "Edited 9 months ago",
      "source": "Google"
    },
    {
      "author": "Alane Klein",
      "rating": 5,
      "text": "This has always been a favorite place because they have vegan biscuits and gravy on the menu. It’s been about 8 years since I visited and I’m happy to report it hasn’t changed much.\n\nThe quantity of food for the price is pretty much unmatched for vegan options. I ordered the biscuit breakfast with tofu. I was very happy with the cold press coffee, it was perfect.\n\nGarden seating was so nice on an August morning. All of the space made it felt very private and chill.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Leena Aurora",
      "rating": 5,
      "text": "Fantastic vibes, food and drinks. Stopped in just minutes before the kitchen closed and wasn’t rushed in ordering food and drinks. Got a vegan breakfast burrito which was INCREDIBLE and also loved the vegan sausage biscuit. Biked over from the river and was lovely to sip on refreshing drinks- got the lemonade and Jamaica, both so delicious. And the vibes are wonderful- a chill welcoming patio + truly a community space within. Can’t wait to return",
      "date": "8 months ago",
      "source": "Google"
    },
    {
      "author": "Albert Danielson",
      "rating": 4,
      "text": "A snazzy little cafe on the Franklin just off the highway. This restaurant functions a little differently than others, but the food is pretty good for the value. When you come in you can seat yourself and put your order in at the register. Tons of indoor and outdoor seating and fun things to check out on the walls. Free Wifi is easily accessible and posted in a few spots. They'll call out when the drinks and food is ready and you'll have to pick that and utensils up yourself. They note that it'll take a bit, but as long as you keep yourself occupied, it's not really noticeable and is certainly worth the wait. Mocha was definitely one of the better ones I've had in the Twin Cities. The Super Red Earth was pretty big and a solid breakfast item that was very filling. Overall, a pretty fun and progressive vibe that's nice to just sit and chill in for a while and get some good food. Was pretty quiet for breakfast, but seemed to start getting packed around brunch/lunchtime. Very vegan friendly menu for those who prefer it, and thankfully not crazily upcharged, and still plenty of options for those who don't swing that way. Definitely worth a visit.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Laura Ford",
      "rating": 5,
      "text": "A very cute cafe with lots of delicious vegan food and good prices. They are able to make most of the menu vegan- all the breakfasts and scrambles. They also have a community cork board and many community health initiative information (narcan kits,exc). This would be a great place to hang out and do work at or have a community event. The food was delicious and can’t wait to go back.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Sasha Renee",
      "rating": 5,
      "text": "I’ve been going here since I was a kid. I am so glad they reopened. I am also happy that they have the same menu. I ordered the super earth and it tasted just as I remembered it.\nI know some people are a bit put off by the atmosphere, but I love it. It’s so eclectic and cozy. They have an awesome patio too.\nIt’s always been an order at the counter place. They call your name when your order is ready. They no longer have the order sheets to fill out.\nI definitely recommend if you like good food with tons of vegetarian and vegan options.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Jasmine Petal",
      "rating": 5,
      "text": "I love seward cafe because the food is decent and vegan also i love how they have a  free room to encourage reusing  belongings including clothes and kitchenware  vds, books, shoes, yarn, beads and any material  belongings people just donate there, but yes i love getting cute grungey worn out clothes also nice clothes too, childrens clothes from there but also sometimes you can find really nice stuff as well like one time i found a whole box of victoria secret bras and garments, VS isnt really my style but like, thats what you can find there is basically anythingg!! I love it there and hope it reopens soon, like, real soon...   edit: they only have part of the restaurant open and the free room doesnt seem to be used which makes me really sad i hope the free room opens soon!!",
      "date": "Edited 3 years ago",
      "source": "Google"
    },
    {
      "author": "Joel Abrahamson",
      "rating": 4,
      "text": "The cafe is back! The full breakfast and brunch menu has returned. The biscuits and gravy (vegan or not) are excellent. Enormous fluffy pancakes and scrambles are also stars of the menu. Full range of espresso drinks and creative herbal tea blends.\nIf you are uncomfortable with the anarchist/ antifa scene... You won't like Seward Cafe.",
      "date": "Edited a year ago",
      "source": "Google"
    },
    {
      "author": "Shannon Mahedy",
      "rating": 5,
      "text": "Seward Cafe is simply the best! The food is great, and it’s an excellent community space. Everyone is welcome, and you feel good about supporting a worker-led cooperative. I love the vegan biscuits and gravy, but everything is delicious and fairly priced.",
      "date": "Edited a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegetarian restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:22:22.054Z"
}