{
  "topProducts": [
    {
      "name": "Coffee",
      "description": "A standard cafe offering with mixed reviews. Some find it great and very good, while others have described it as decent, acidic, or gross. No longer self-serve.",
      "category": "drink",
      "badge": "Top Pick",
      "quotes": [
        "Never had their food it's one star because the coffee was extremely acidic and frankly gross :( but I love everything else about this place and have been here for many events",
        "The person who took our order was borderline dismissive of allergen concerns and was very preoccupied talking with a friend at the counter, to the point their friend was the one who refilled our coffees despite them not being an employee at the cafe",
        "Me, my husband and our friend went and enjoy the breakfast and coffee as we had years before"
      ],
      "reviewMentions": 18
    },
    {
      "name": "Fluffy Pancakes",
      "description": "A favorite dish for many customers, mentioned as a reason for repeat visits. Described as a standout item, especially with maple syrup.",
      "category": "entree",
      "badge": "Popular",
      "quotes": [
        "I get the fluffy pancakes every time I go",
        "Enormous fluffy pancakes and scrambles are also stars of the menu"
      ],
      "reviewMentions": 2
    },
    {
      "name": "Tofu Scramble",
      "description": "A popular vegan breakfast option. The smoky tempeh within the scramble is frequently highlighted as being flavorful and satisfying.",
      "category": "entree",
      "badge": "Popular",
      "quotes": [
        "I didn’t love the hash browns, too oily for me, but the tofu scramble was good",
        "I had the tofu scramble, and the smoky tempeh in it was hands-down my favorite part—so flavorful and satisfying",
        "Otherwise, loved the tofu scramble and the vegan sausage patty was good"
      ],
      "reviewMentions": 3
    },
    {
      "name": "Vegan Sausage and Biscuits",
      "description": "A savory vegan breakfast dish, specifically praised in reviews. Also referred to as 'vegan breakfast sausage and biscuits and gravy'.",
      "category": "entree",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Monster Mash",
      "description": "A unique hot beverage made with apple cider and miso caramel, topped with coconut whip. Described by one reviewer as a 'top 10 drink'.",
      "category": "drink",
      "badge": "Featured",
      "quotes": [
        "Had the monster mash and its landing in my top 10 drinks of my life"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Vegan Breakfast Burrito",
      "description": "A breakfast burrito with a vegan filling, described as 'INCREDIBLE' by a reviewer.",
      "category": "entree",
      "badge": "Featured",
      "quotes": [
        "Got a vegan breakfast burrito which was INCREDIBLE and also loved the vegan sausage biscuit"
      ],
      "reviewMentions": 1
    },
    {
      "name": "Super Earth / Basic Green Earth",
      "description": "A long-standing menu item consisting of hash browns and broccoli. A nostalgic favorite for some, though there are reports of recent, uncommunicated changes to the recipe.",
      "category": "entree",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    }
  ],
  "highlightedReviews": [
    {
      "author": "Marques Garrett",
      "rating": 5,
      "text": "Seward Cafe is a gem for anyone looking for amazing vegan options! I had the tofu scramble, and the smoky tempeh in it was hands-down my favorite part—so flavorful and satisfying. The fluffy pancake was also a standout, especially drizzled with maple syrup. Cozy atmosphere, great food, and friendly service. Definitely worth a visit!",
      "date": "9 months ago",
      "source": "Google"
    },
    {
      "author": "Albert Danielson",
      "rating": 4,
      "text": "A snazzy little cafe on the Franklin just off the highway. This restaurant functions a little differently than others, but the food is pretty good for the value. When you come in you can seat yourself and put your order in at the register. Tons of indoor and outdoor seating and fun things to check out on the walls. Free Wifi is easily accessible and posted in a few spots. They'll call out when the drinks and food is ready and you'll have to pick that and utensils up yourself. They note that it'll take a bit, but as long as you keep yourself occupied, it's not really noticeable and is certainly worth the wait. Mocha was definitely one of the better ones I've had in the Twin Cities. The Super Red Earth was pretty big and a solid breakfast item that was very filling. Overall, a pretty fun and progressive vibe that's nice to just sit and chill in for a while and get some good food. Was pretty quiet for breakfast, but seemed to start getting packed around brunch/lunchtime. Very vegan friendly menu for those who prefer it, and thankfully not crazily upcharged, and still plenty of options for those who don't swing that way. Definitely worth a visit.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Joel Abrahamson",
      "rating": 4,
      "text": "The cafe is back! The full breakfast and brunch menu has returned. The biscuits and gravy (vegan or not) are excellent. Enormous fluffy pancakes and scrambles are also stars of the menu. Full range of espresso drinks and creative herbal tea blends.\nIf you are uncomfortable with the anarchist/ antifa scene... You won't like Seward Cafe.",
      "date": "Edited a year ago",
      "source": "Google"
    },
    {
      "author": "Jenny Saufl",
      "rating": 5,
      "text": "Always the best. Been going here for over 20 years, but moved away from MN in 2014. I was devastated that it closed during covid and remained closed while I was last in MN.\n\nFast forward to May, visiting Minnesota and so happy to find it open and working as it used to. Me, my husband and our friend went and enjoy the breakfast and coffee as we had years before.\n\nI was a little sad that you don't write your own ticket and the coffee is no longer self serve, but I absolutely understand these changes.\n\nWill make sure to visit every time I'm in the area.",
      "date": "7 months ago",
      "source": "Google"
    },
    {
      "author": "Ivy Bolthouse",
      "rating": 5,
      "text": "Love Seward cafe overall. Good prices, good ethics. I have especially enjoyed their vegan breakfast sausage and biscuits and gravy. I didn’t love the hash browns, too oily for me, but the tofu scramble was good. As far as drinks go, I have had mixed experiences. The chai was good one time but the next time it had an overpowering taste of cloves and I struggled to drink it (and I do like spicy chai) so I hesitate to order that again.\n\nThey have 2 single-user bathrooms which are both gender neutral.",
      "date": "Edited 9 months ago",
      "source": "Google"
    },
    {
      "author": "Alane Klein",
      "rating": 5,
      "text": "This has always been a favorite place because they have vegan biscuits and gravy on the menu. It’s been about 8 years since I visited and I’m happy to report it hasn’t changed much.\n\nThe quantity of food for the price is pretty much unmatched for vegan options. I ordered the biscuit breakfast with tofu. I was very happy with the cold press coffee, it was perfect.\n\nGarden seating was so nice on an August morning. All of the space made it felt very private and chill.",
      "date": "2 years ago",
      "source": "Google"
    },
    {
      "author": "Santiago O'Connor",
      "rating": 5,
      "text": "The Seward will continue to be the best Breakfast in Minnesota on my book.\nSomething there is to mention. If graffiti offends you, or the occasional homeless person hanging out inside or the weirdos that choose to frequent here (me included)...bothers you.\nThan this fine establishment is not for you.\nIf you are fine with the crowd, please go in and enjoy their food cause is really good",
      "date": "Edited 3 months ago",
      "source": "Google"
    },
    {
      "author": "Leena Aurora",
      "rating": 5,
      "text": "Fantastic vibes, food and drinks. Stopped in just minutes before the kitchen closed and wasn’t rushed in ordering food and drinks. Got a vegan breakfast burrito which was INCREDIBLE and also loved the vegan sausage biscuit. Biked over from the river and was lovely to sip on refreshing drinks- got the lemonade and Jamaica, both so delicious. And the vibes are wonderful- a chill welcoming patio + truly a community space within. Can’t wait to return",
      "date": "8 months ago",
      "source": "Google"
    },
    {
      "author": "Taylor Ruud",
      "rating": 5,
      "text": "Their pancakes are straight up delicious. I had the carnitas omelette w/ sourdough bread & jam, which was also a hit. Didn't care for the medium roast coffee, but it was by no means sub par - just personal preferences. Highly recommend, especially during summer months when the patio is open!",
      "date": "5 years ago",
      "source": "Google"
    },
    {
      "author": "Espen Dinneen",
      "rating": 4,
      "text": "Seward Cafe is so great!!! The breakfast here is fantastic, the drinks are great, and the vibes are also so nice! Seward Cafe is very community based so sometimes they host events or sell local things too! I really enjoy the community atmosphere that this cafe upholds. I do knock a star off because I think the service is very hit or miss. I've been here 5+ times and maybe 2 or so times I had the absolute sweetest barista & great interactions!!! The other times, not so much. Breakfast is also very hit or miss depending on who is working. Might take 10 minutes to get your food-- might take 40 minutes to get your food. Consistency seems to be a weak point with this cafe, but the quality and affordability makes up for it by a landslide. I really love how they have a pay-it-forward type of donation system where you can add funds to a card for those who are in need of food or something to drink. I'll keep coming back here for sure, I recommend others to try them out too!!",
      "date": "3 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "REAL - From Apify-scraped Google reviews",
  "lastUpdated": "2026-02-05T23:22:30.077Z"
}