{
  "topProducts": [
    {
      "name": "just shroomin custard",
      "description": "A vegan custard with great flavor, though the texture is more of a mush/goop.",
      "category": "appetizer",
      "reviewMentions": 0,
      "badge": null,
      "quotes": []
    },
    {
      "name": "Vegasm",
      "description": "A consistently good vegan dish.",
      "category": "entree",
      "reviewMentions": 3,
      "badge": "Popular",
      "quotes": [
        "They do flavors so well (always recommend the pork)(and the Vegasm is never bad) - the people are great, and the vibes are good",
        "Best vegasm I ever had",
        "I’ve particularly enjoyed the vegasm option despite being a meat eater (although their dishes with meat are also great)"
      ]
    },
    {
      "name": "pad thai salad",
      "description": "A fresh and satisfying take on a classic pad thai.",
      "category": "entree",
      "reviewMentions": 4,
      "badge": "Top Pick",
      "quotes": [
        "Food-wise, the pad thai salad was a fresh, satisfying take on a classic",
        "The Pad Thai salad was amazing (my favorite dish)",
        "We've gotten the pad Thai salad every time"
      ]
    },
    {
      "name": "jerk cauliflower",
      "description": "A dish with an ideal balance of spice and flavor.",
      "category": "entree",
      "reviewMentions": 4,
      "badge": "Top Pick",
      "quotes": [
        "The jerk cauliflower hit the ideal balance of spice and flavor",
        "The appetizers and small bites are where it's at: jerk cauliflower, mascarpone polenta, potato pave and shroomin' were so so good",
        "Loved the jerk cauliflower and pork steamed buns"
      ]
    },
    {
      "name": "health potion",
      "description": "A special non-alcoholic beverage.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "And as a last note they did have this wonderful special beverage that I did not get but I was incredibly pleased to see it was a health potion that without alcohol gave you plus two to health, but with alcohol you took a hit of minus two"
      ]
    }
  ],
  "highlightedReviews": [
    {
      "author": "Matthew Smith",
      "rating": 5,
      "text": "Loved the shrimp teaser.  The Pad Thai salad was amazing (my favorite dish). Loved the jerk cauliflower and pork steamed buns.  Libations were great as well.  Recommend the why not minot (very refreshing gin drink).  Also recommend the date night loving!  Accommodating to food allergies/sensitivities was a huge plus!  Would love to see a vegan mayo option for the aioli sauces.",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Adriane Gilbert",
      "rating": 4,
      "text": "We had been wanting to try this place for years but somehow never got around to it until now. Maybe our expectations were too high? We are very adventurous eaters, travel a lot, and love big flavors. The service was excellent, and the atmosphere was nice, but the wall art seemed sloppy and amateur. I get it, it's supposed to be silly and wacky to match the theme of the restaurant, but it just didn't appeal to us.\n\nOur drinks were good, but nothing to write home about. We had the tiger  prawn teaser, which tasted like a regular fried shrimp with no standout flavors. The \"just shroomin\" custard had a great flavor but was more of a mush/goop, and I understand it can't be a real custard because it's vegan, but the texture was unappealing.\nThe pork buns were good, but again, nothing standout or unique. The best dish by far was the market fish. Cooked to a perfect, blackened crust and with a delicious sauce. I could have used 3x the sauce. The potatoes that came with it were also good, but I would have preferred a different veg side that would, IMO, pair better with the fish. Overall we really liked it and would recommend it to anyone looking for a nice dinner date.",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "Mary Bach",
      "rating": 5,
      "text": "Delicious food, so nummy! The Teasers are each unique and special - don't miss East Fried Pride (pork belly!!) and the daily ramen special. They do vegan dishes easily and they taste great (per my vegan friend). I loved the braised pork eggs Benedict. I'll definitely return here.",
      "date": "2 months ago",
      "source": "Google"
    },
    {
      "author": "Aaron Ziegler",
      "rating": 5,
      "text": "Have only been once very good food and cocktails, with plenty of vegan and non-veg options. Service was prompt, very friendly and professional. Recommend.",
      "date": "2 weeks ago",
      "source": "Google"
    },
    {
      "author": "John Madison",
      "rating": 5,
      "text": "First, any review that is less than 5 stars for this establishment is just plain wrong. Second, between Tongue in Cheek & Bruson's Pub (Across the street) these are the two best restaurants in the Twin Cities, hands down. And somehow, they both ended up on the same street in East St. Paul.\n\nI have been to Tongue in Cheek over a dozen times and I can confidently say this is by far the most consistently perfect eating establishment I've ever been to. I have eaten through the menu- front to back- and never been even slightly disappointed.\nIt blows my mind that restaurants like Porzana, Khaluna, and Spoon and Stable get so much press and recognition, and somehow Tongue in Cheek slips under the radar. Those \"James Beard\" establishments don't hold a candle to Tongue in Cheek's quality, service, and product; period!\n\nI could talk about this place all day, and matter of fact I find myself doing so...To co-workers, visitors to the Twin Cities, friends, anyone I can. I'll say this, there isn't a bad thing on the menu, but a couple of my all-time favorites are as follows:\n\nThe Bacon Dashi Ramen: I have had Ramen at nearly any place that has it on the menu in the Twin Cities (try Staff Meeting sometime!) and this is by far the best, hands down. The smokiness and rich bacon broth is something only heaven could conjure. It is the best ramen broth I have ever had in my life. I get it with the chicken which is always perfectly cooked and the perfect addition to this dish. I think about the Bacon Dashi Ramen at least twice a week, dreaming of it, yearning for another bowl!\n\nChicken & Waffle: Once again, the best rendition of the classic breakfast staple, chicken and waffles. The batter they use for their waffles has the most perfectly balanced sweetness, along with their incredible chicken and the cilantro and peanuts are a welcome addition as well. The flavor of this dish is outstanding. Like everything on Tongue in Cheeks menu: packed with flavor.\n\nTeasers: I love every teaser I have ever tried from here, but my two ones that I could never not order are East Fried Pride (some serious magic must be used to make this perfect bite on pork belly, melts in your mouth!), and Shroomin' that's packed with the most delicious and rich mushroom flavor.\n\nCrosseyed Mary (Cocktail): My favorite cocktail in the Twin Cities, essentially a bloody mary like martini. The gin is infused with a bunch of vegetables to create this heavenly savory flavor with a hit of garlic. Served up in a martini glass, I have to stop myself from drinking more than two every visit. For the savory cocktail lover, this is a must!\n\nAlso, the service here is always so dang good. Every single person-front of house to back of house is a master of their craft.\n\nIn conclusion, thank you Tongue in Cheek for being my favorite place in the world to eat and drink. I am a forever fan of yours. XO",
      "date": "7 months ago",
      "source": "Google"
    },
    {
      "author": "Jon Rasmussen",
      "rating": 5,
      "text": "Had a wonderful experience at Tongue in Cheek! From the service to the food ... awesome! Our server (Wille ?) expertly guided my wife and me to great meal choices. I had the Pad Thai with tofu. I've never had tofu before and was concerned if I'd like it. He described it so well that it took the fear out of it for me. I knew what to expect and he was spot on ... it was amazing! We'll be back again. I love this place!",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Jessica Block",
      "rating": 5,
      "text": "We go out to eat often. Probably too often. It takes a lot to truly stand out at this point, and this place absolutely did.\n\nEvery bite was delicious. A special shout-out to the teasers, which we almost skipped because we weren’t totally sure what they were from the menu. They’re small, perfectly crafted bites and honestly one of the highlights of our meal. Don’t sleep on them.\n\nThe cocktails were incredibly balanced, creative without being weird for the sake of it, and the flight option is a dangerously delightful idea. The atmosphere is casual, cozy, and genuinely welcoming, the kind of place that immediately makes you want to settle in and stay awhile. Food-wise, the pad thai salad was a fresh, satisfying take on a classic. The jerk cauliflower hit the ideal balance of spice and flavor.\n\nService was fantastic across the board. Our waiter was knowledgeable and gave helpful guidance. Also, every staff member who passed our table checked in and made sure we had what we needed. A small but much-appreciated touch was fresh silverware and plates between courses. It’s the kind of detail that quietly tells you they care.\n\nThis place is an absolute gem in East St. Paul. A true standout and one we won’t soon forget. I’m already looking forward to going back.",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Hollie Chase",
      "rating": 5,
      "text": "One of my fav restaurants in MN. I appreciate delicious, flavorful, unique dishes that I can’t make at home and this place checks those boxes. Dining here can turn the worst of days around. Wonderful service and staff as well.\n\nOrdered the steamed pork buns (not pictured), ramen, and smoked salmon sandwich. The pork in the steamed buns and the ramen melted in your mouth. The smoked salmon sandwich had incredible flavor elements and the most perfect egg over easy. 10/10.",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Peter Grafstrom",
      "rating": 5,
      "text": "Had another amazing dinner here. The steamed buns are a highlight. Both the pork and the fried chicken are good choices. We've gotten the pad Thai salad every time. The jerk cauliflower was great, be sure to catch the sauce at the bottom they really combine well. Potato Pave was a highlight this time, ask for a bit more sauce. The basil raspberry fried sponge cake will inspire some new deserts at home and maybe a lemonade concoction.",
      "date": "6 months ago",
      "source": "Google"
    },
    {
      "author": "Melissa Sterling",
      "rating": 5,
      "text": "Update, 2025: Tongue in Cheek is still my favorite restaurant for top tier food and service! I can't think of a single meal I've had here that wasn't a symphony on my taste buds. The Watermelon Squeeze appetizer on their current menu is delightful, and our brunch items (Market Omelet and Belgian Waffle) are amazing. I also enjoyed the Ginger's Soul (mocktail) - which proved to be a divine companion to the waffles!\n\nOriginal post from 2020: One of my favorite places to go for a delicious meal with fantastic service. Food so good it inspires me to experiment at home! And food so good it encourages me to try new things on their menu, because I know it won't disappoint!",
      "date": "Edited 6 months ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:25:23.198Z"
}