{
  "topProducts": [
    {
      "name": "Mushroom Bulgogi Burrito",
      "description": "A vegan burrito that is very well seasoned, though the herbs may not be distributed throughout.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream"
      ]
    },
    {
      "name": "Mushroom Bulgogi Hummus",
      "description": "A full meal hummus bowl with a sweet and spicy flavor. The texture is noted as airy.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream"
      ]
    },
    {
      "name": "Cauliflower Zucchini Sandwich",
      "description": "A vegan sandwich that is described as a bit bland and needing sauce for flavor.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream"
      ]
    },
    {
      "name": "Battered Fries",
      "description": "Vegan battered fries, described as good.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream"
      ]
    },
    {
      "name": "Vegan Black Ice Cream",
      "description": "A vegan ice cream that is not overly sweet, described as perfect and delicious.",
      "category": "dessert",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream"
      ]
    },
    {
      "name": "Crispy Tofu Bowl",
      "description": "A very good vegan tofu bowl, could be spicier.",
      "category": "entree",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "This time, I ordered battered fries, crispy tofu bowl, chips and guacamole, mushroom bulgogi hummus, My son, who is not vegan, ordered beef kofta Burger and side of barbecue beef"
      ]
    },
    {
      "name": "Chips and Guacamole",
      "description": "Vegan guacamole with a fantastic and unique flavoring.",
      "category": "appetizer",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "This time, I ordered battered fries, crispy tofu bowl, chips and guacamole, mushroom bulgogi hummus, My son, who is not vegan, ordered beef kofta Burger and side of barbecue beef"
      ]
    },
    {
      "name": "Vegan Ice Cream Cake",
      "description": "A beautiful and delicious vegan ice cream cake.",
      "category": "dessert",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": [
        "The the vegan ice cream cake and brought it home"
      ]
    },
    {
      "name": "Cocktails",
      "description": "Yummy cocktails are available.",
      "category": "drink",
      "reviewMentions": 1,
      "badge": "Featured",
      "quotes": []
    }
  ],
  "highlightedReviews": [
    {
      "author": "M Moore",
      "rating": 4,
      "text": "We first visited on August 3, 2025 for a to-go order. We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream. The burrito was great- very well seasoned even with the sauce on the side. One downside is that the herbs come out. Wow delicious, we're not throughout the burrito so we didn't get it in each bite. The sandwich was just okay- it seemed pretty bland and needed the sauce, which we had on the side. Without the sauce, it didn't have as much flavor as it should. It needed more spice ex, too. The battered fries were good. The hummus was terrific- it wasn't something we were accustomed to as it's usually a side or appetizer, but this was all meal. We loved the sweet and spicy flavor of it and we hope that flavor profile is the norm. Texturally, the hummus was a bit too airy and almost baby food like for me. I prefer hummus with a bit more body- increasing the amount of olive oil and tahini usually adds body to hummus. I found the pita to be too spongy and probably should have been served warm; however, it was good and I knew I would order it again. The ice cream was fantastic! Not sickly sweet. Like some vegan dessert treats are- it was perfect and delicious. My second trip was today, August 7, 2025. This time, I ordered battered fries, crispy tofu bowl, chips and guacamole, mushroom bulgogi hummus, My son, who is not vegan, ordered beef kofta Burger and side of barbecue beef. My son said his meal was excellent, he would 100% return and he will tell everyone else to go back. He said everything was well seasoned and he found the smokiness of the burger \"unbelievable.\" For me, the guacamole was fantastic- the flavoring was new to me, but it was terrific and I will order it again and again. The crispy tofu bowl was also very very good- I would have preferred that it were spicier, but I enjoyed it and would order it again. Today, the hummus wasn't great and, if it had tasted like today's version when I initially ordered, I would have never ordered it again. It was not spicy at all- it was quite flat and bland. I was surprised considering how great it was a couple days earlier. I packed it up and brought it home and mixed together gochuchang, soy, Sriracha, and a few other spices to give it a boost. I hope they can get some consistency going with the flavor profile and, if customers have an issue with a spicier version, give us the option of choosing plain, spicy, or extra spicy. The the vegan ice cream cake and brought it home. Service was excellent at the kitchen and milk jam. The ice cream cake was worth every penny; not only was it beautiful, but it was also delicious.",
      "date": "Edited 5 months ago",
      "source": "Google"
    },
    {
      "author": "Willow",
      "rating": 5,
      "text": "Super flavorful food! Lots of vegetarian and vegan options but also great meat options. The Korean beef rice bowl was tasty and filling. The mushroom hummus bowl was super creamy and filling. My favortie thing was probably the Brussel sprouts, they were packed with flavor from the savory fishsauce and nice and crispy. This place is definitely a come back again!",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "Nikhil Saxena",
      "rating": 4,
      "text": "Interesting fusion food and most of it is great. A variety of options even if you have dietary restrictions and the prices are very fair. Highly recommend the Brussel Sprouts (not vegan as they have fish sauce) and Bangkok Burritos. Do not the reccomend the Bulgogi Mushroom Hummus Bowl - unfortunately not all their flavor combinations work out.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Tom O'Neill",
      "rating": 5,
      "text": "Been going to this place for years, a staple in uptown that has a great menu, with great rotating options as well as fantastic gluten free and vegan choices. Service has always been exceptional, Kieran was very helpful last time I was in, ensuring I got a bowl that fit my dietary restrictions. Highly recommend.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Jenni Lamprech",
      "rating": 5,
      "text": "Plenty of options for all dietary preferences, and they're all delicious! Fantastic restaruant, great service, friendly staff, food was amazing. The vegan special sauce is so good! Reasonable prices, highly recommend this place.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Holly Santiago",
      "rating": 5,
      "text": "Went here for lunch today (12/5) -first time in about five years- and was blown away! The two ppl at the register were incredibly helpful and welcoming. They suggested favorites to order, engaged in convos and questions about the food, and were so so so friendly! Even though this place is somewhat self-service, both people at the register came out to drop off food/waters/napkins/etc and chat a bit about the food and ice cream (they sell milk jam pints!). The place was clean and bright… and that MFC still hits after being on their menu for over 10 years! It all just felt “above and beyond” …a genuinely friendly vibe unlike anything I’ve experienced here before! It’s always been good, but my friend and I felt so at home and comfortable today :)",
      "date": "a month ago",
      "source": "Google"
    },
    {
      "author": "James Brennan",
      "rating": 5,
      "text": "World Street Kitchen is an absolute gem! The menu is lean mean eclectic bliss. The lovely location in the heart of Uptown is always wonderful to visit. The staff is incredible, the service is snappy, and the restaurant has a welcoming ambience.\n\nOriginal Hummus: Extremely strong start to the meal with extremely well made hummus with a perfect spice to it.\n\nMFC Biscuit Sandwich: This is a perfect dish. The perfectly crisp Moroccan fried chicken gives way to these craveable preserved carrots on a moist cheddar Biscuit. Not to be forgotten is the spicy feta spread which I would be happy spreading on just about anything, it is perfect.\n\nRed Curry Chicken Burrito: Another incredible dish with perfectly cooked chicken, in a creamy sauce, and in a perfect tortilla.\n\nKOREAN “BBQ” BEEF SHORT RIBS BURRITO: This is a contender for the best dish as well, the beef is perfectly cooked, the flavor is rich and deep. The rice inside is perfect and there is an amazing hit of cilantro.\n\nWSK never fails to impress and they have my highest recommendation.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Lee Kafkas",
      "rating": 5,
      "text": "I can't rave enough about the delicious food at world Street kitchen. I found a few favorites like the OG chicken bowl and the brussel sprouts. The red curry burrito, Korean BBQ bowl, lemongrass meatballs... Many delicious items. Too many choices for a terrific meal.\nOrder on your phone or add an iPad. Take a number and your seat, and they will deliver the food to you.\nThe place is a little too fast casual to be completely cozy, but the lighting is cool and the atmosphere is very vibrant.",
      "date": "Edited 7 months ago",
      "source": "Google"
    },
    {
      "author": "Hudson Klein",
      "rating": 5,
      "text": "Definitely my go-to restaurant, delicious fusion I highly recommend the beef or chicken burrito in a bowl. Probably the number one place to order from but going there isn’t amazing as they lack a good atmosphere. The ice cream that you order is delicious and super creative next door, w  hi icy you order with the meal. I would highly recommend ordering from here!!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Emma LeValley",
      "rating": 5,
      "text": "Delicious food, cool atmosphere. Casual dining (order via QR code, they bring it out) and a great experience. Everyone was super nice. One of the employees noticed me being a camel and chugging a bunch of the tiny DIY water station cups and brought me a carafe.\nNow for the food: amazing. I had the red curry chicken burrito, which was delicious. I was nervous because it's labeled \"spicy,\" but it was very manageable spice-wise and super flavorful. I forgot to take a picture of my husband's Morrocan fried chicken sandwich on biscuit bread, which I had a bite of and was so unique and amazing. It had a carrot slaw on it that was great! Y'all gotta come here!",
      "date": "a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "VEGAN-FILTERED - Vegan-Friendly restaurant, only vegan items/reviews",
  "lastUpdated": "2026-02-06T02:35:22.198Z"
}