{
  "topProducts": [
    {
      "name": "Korean BBQ Beef (Short Rib)",
      "description": "A versatile and popular item served in various forms like a rice bowl, burrito, or with hummus. Reviewers praise it as 'tasty and filling.'",
      "category": "Entree",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Hummus Bowl",
      "description": "A main course-sized bowl of creamy, airy hummus. Often mentioned with toppings like Korean beef or mushroom bulgogi, and praised for its unique and flavorful combinations.",
      "category": "Entree",
      "badge": "Top Pick",
      "quotes": [
        "The mushroom hummus bowl was super creamy and filling",
        "We got the Korean “BBQ” Beef Short Ribs Hummus Bowl and the Deluxe Chicken Shawarma Sandwich",
        "The hummus bowl was so good but still wondering what does sub lettuce mean in the in app ordering customizations"
      ],
      "reviewMentions": 5
    },
    {
      "name": "Red Curry Burrito",
      "description": "Specifically mentioned by multiple reviewers as being 'excellent' and 'terrific.' Often contains chicken.",
      "category": "Entree",
      "badge": "Popular",
      "quotes": [
        "The red curry burrito, Korean BBQ bowl, lemongrass meatballs",
        "We enjoyed the red curry burrito, brussel sprouts and a salad"
      ],
      "reviewMentions": 2
    },
    {
      "name": "Yum Yum Bowls",
      "description": "A signature dish described by multiple reviewers as 'amazing' and 'fantastic.'",
      "category": "Entree",
      "badge": "Popular",
      "quotes": [
        "The yum yum bowls are amazing",
        "Their Yum Yum bowls are also fantastic"
      ],
      "reviewMentions": 2
    },
    {
      "name": "MFC / Chicken Sandwich",
      "description": "A long-standing and beloved menu item. Described as a sandwich that 'still hits after being on their menu for over 10 years' and that any version is 'awesome.'",
      "category": "Entree",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    },
    {
      "name": "Brussel Sprouts",
      "description": "A highly-rated side dish, noted for being 'packed with flavor from the savory fishsauce and nice and crispy.'",
      "category": "Side",
      "badge": "Top Pick",
      "quotes": [
        "My favortie thing was probably the Brussel sprouts, they were packed with flavor from the savory fishsauce and nice and crispy",
        "I found a few favorites like the OG chicken bowl and the brussel sprouts",
        "We enjoyed the red curry burrito, brussel sprouts and a salad"
      ],
      "reviewMentions": 5
    },
    {
      "name": "Ice Cream & Desserts",
      "description": "Reviewers frequently mention 'amazing' ice cream treats, cakes (including vegan options), and cookies. Often associated with the co-located MilkJam Creamery.",
      "category": "Dessert",
      "badge": null,
      "quotes": [],
      "reviewMentions": 0
    }
  ],
  "highlightedReviews": [
    {
      "author": "M Moore",
      "rating": 4,
      "text": "We first visited on August 3, 2025 for a to-go order. We are vegan, so we ordered the mushroom bulgogi burrito, mushroom bulgogi hummus, cauliflower zucchini sandwich, battered fries, our and vegan black ice cream. The burrito was great- very well seasoned even with the sauce on the side. One downside is that the herbs come out. Wow delicious, we're not throughout the burrito so we didn't get it in each bite. The sandwich was just okay- it seemed pretty bland and needed the sauce, which we had on the side. Without the sauce, it didn't have as much flavor as it should. It needed more spice ex, too. The battered fries were good. The hummus was terrific- it wasn't something we were accustomed to as it's usually a side or appetizer, but this was all meal. We loved the sweet and spicy flavor of it and we hope that flavor profile is the norm. Texturally, the hummus was a bit too airy and almost baby food like for me. I prefer hummus with a bit more body- increasing the amount of olive oil and tahini usually adds body to hummus. I found the pita to be too spongy and probably should have been served warm; however, it was good and I knew I would order it again. The ice cream was fantastic! Not sickly sweet. Like some vegan dessert treats are- it was perfect and delicious. My second trip was today, August 7, 2025. This time, I ordered battered fries, crispy tofu bowl, chips and guacamole, mushroom bulgogi hummus, My son, who is not vegan, ordered beef kofta Burger and side of barbecue beef. My son said his meal was excellent, he would 100% return and he will tell everyone else to go back. He said everything was well seasoned and he found the smokiness of the burger \"unbelievable.\" For me, the guacamole was fantastic- the flavoring was new to me, but it was terrific and I will order it again and again. The crispy tofu bowl was also very very good- I would have preferred that it were spicier, but I enjoyed it and would order it again. Today, the hummus wasn't great and, if it had tasted like today's version when I initially ordered, I would have never ordered it again. It was not spicy at all- it was quite flat and bland. I was surprised considering how great it was a couple days earlier. I packed it up and brought it home and mixed together gochuchang, soy, Sriracha, and a few other spices to give it a boost. I hope they can get some consistency going with the flavor profile and, if customers have an issue with a spicier version, give us the option of choosing plain, spicy, or extra spicy. The the vegan ice cream cake and brought it home. Service was excellent at the kitchen and milk jam. The ice cream cake was worth every penny; not only was it beautiful, but it was also delicious.",
      "date": "Edited 5 months ago",
      "source": "Google"
    },
    {
      "author": "James Brennan",
      "rating": 5,
      "text": "World Street Kitchen is an absolute gem! The menu is lean mean eclectic bliss. The lovely location in the heart of Uptown is always wonderful to visit. The staff is incredible, the service is snappy, and the restaurant has a welcoming ambience.\n\nOriginal Hummus: Extremely strong start to the meal with extremely well made hummus with a perfect spice to it.\n\nMFC Biscuit Sandwich: This is a perfect dish. The perfectly crisp Moroccan fried chicken gives way to these craveable preserved carrots on a moist cheddar Biscuit. Not to be forgotten is the spicy feta spread which I would be happy spreading on just about anything, it is perfect.\n\nRed Curry Chicken Burrito: Another incredible dish with perfectly cooked chicken, in a creamy sauce, and in a perfect tortilla.\n\nKOREAN “BBQ” BEEF SHORT RIBS BURRITO: This is a contender for the best dish as well, the beef is perfectly cooked, the flavor is rich and deep. The rice inside is perfect and there is an amazing hit of cilantro.\n\nWSK never fails to impress and they have my highest recommendation.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Shai",
      "rating": 5,
      "text": "We came here unintentionally because we were getting ice cream at MilkJam next door. The unique menu is what intrigued us. The menu items are an actual blend of different cuisines. We got the Korean “BBQ” Beef Short Ribs Hummus Bowl and the Deluxe Chicken Shawarma Sandwich.\nI would’ve never thought that kimchi and hummus could go so well together. It felt like a Ratatouille moment when Remi discovered the joy of eating fruit and cheese together. We sat in about 15 minutes of pure silence just devouring everything. We plan to come back and try some of their other menu items.\n\nThe only downside is that the area can get quite congested on the weekend and parking isn’t always the easiest to find. But it’s great because you can get a delicious dinner and then go next door to get ice cream that comes in some very unique flavors.",
      "date": "4 months ago",
      "source": "Google"
    },
    {
      "author": "Jose C",
      "rating": 4,
      "text": "Wh had the beef shawarma tacos and the chicken biscuit sandwich, which were both very good. The taco meat was tender and well seasoned. The chicken sandwich had great flavor. However, the food is a bit over priced for an  a la carte menu. For example the $15 sandwich did not come with a side, and there was only 2 tacos for $12.",
      "date": "10 months ago",
      "source": "Google"
    },
    {
      "author": "Dean Trimble",
      "rating": 4,
      "text": "I mentioned to my wife that I wanted authentic Korean BBQ and she found this place. I had the short rib lettuce wraps, she had the falafel burger and my sone had the Korean Short Rib Bowl. Overall I would say the food was good, but I am still in search of authentic Korean BBQ. Not to say this wasn’t authentic, but it was more of a fusion between Korean and middle eastern.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Emma LeValley",
      "rating": 5,
      "text": "Delicious food, cool atmosphere. Casual dining (order via QR code, they bring it out) and a great experience. Everyone was super nice. One of the employees noticed me being a camel and chugging a bunch of the tiny DIY water station cups and brought me a carafe.\nNow for the food: amazing. I had the red curry chicken burrito, which was delicious. I was nervous because it's labeled \"spicy,\" but it was very manageable spice-wise and super flavorful. I forgot to take a picture of my husband's Morrocan fried chicken sandwich on biscuit bread, which I had a bite of and was so unique and amazing. It had a carrot slaw on it that was great! Y'all gotta come here!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Lee Kafkas",
      "rating": 5,
      "text": "I can't rave enough about the delicious food at world Street kitchen. I found a few favorites like the OG chicken bowl and the brussel sprouts. The red curry burrito, Korean BBQ bowl, lemongrass meatballs... Many delicious items. Too many choices for a terrific meal.\nOrder on your phone or add an iPad. Take a number and your seat, and they will deliver the food to you.\nThe place is a little too fast casual to be completely cozy, but the lighting is cool and the atmosphere is very vibrant.",
      "date": "Edited 7 months ago",
      "source": "Google"
    },
    {
      "author": "Hudson Klein",
      "rating": 5,
      "text": "Definitely my go-to restaurant, delicious fusion I highly recommend the beef or chicken burrito in a bowl. Probably the number one place to order from but going there isn’t amazing as they lack a good atmosphere. The ice cream that you order is delicious and super creative next door, w  hi icy you order with the meal. I would highly recommend ordering from here!!",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Tom O'Neill",
      "rating": 5,
      "text": "Been going to this place for years, a staple in uptown that has a great menu, with great rotating options as well as fantastic gluten free and vegan choices. Service has always been exceptional, Kieran was very helpful last time I was in, ensuring I got a bowl that fit my dietary restrictions. Highly recommend.",
      "date": "a year ago",
      "source": "Google"
    },
    {
      "author": "Nikhil Saxena",
      "rating": 4,
      "text": "Interesting fusion food and most of it is great. A variety of options even if you have dietary restrictions and the prices are very fair. Highly recommend the Brussel Sprouts (not vegan as they have fish sauce) and Bangkok Burritos. Do not the reccomend the Bulgogi Mushroom Hummus Bowl - unfortunately not all their flavor combinations work out.",
      "date": "a year ago",
      "source": "Google"
    }
  ],
  "timingInsights": [],
  "dataQuality": "REAL - From Apify-scraped Google reviews",
  "lastUpdated": "2026-02-06T00:15:38.523Z"
}